[
    {
        "amount": "12500.00",
        "classification": "Freshman",
        "deadline": "12/2025",
        "description": "The Emerging Leaders Award recognizes outstanding male freshman students in Florida pursuing a degree in History. Applicants must demonstrate academic excellence with a minimum GPA of 2.6, and a strong commitment to leadership within their communities. This scholarship particularly supports students of Asian or other racial backgrounds who are also involved in innovative research projects or initiatives that address contemporary historical issues. While not need-based, this merit-based award values exceptional leadership potential and academic achievement. HBCU students are eligible and encouraged to apply.",
        "gender": "Male",
        "gpa": 2.6,
        "hbcu": true,
        "international": false,
        "link": "https://www.example.com/emergingleadersaward",
        "location": "Florida",
        "major": "History",
        "merit_based_aid": true,
        "need_based_aid": false,
        "race": [
            "Asian",
            "Other"
        ],
        "scholarship_name": "Emerging Leaders Award"
    },
    {
        "amount": "15000.00",
        "classification": "Sophomore",
        "deadline": "08/2025",
        "description": "The Community Service Grant recognizes outstanding sophomore students who demonstrate a commitment to making a difference in their communities. Applicants must be female, majoring in Computer Science, and possess a minimum GPA of 3.7. This merit- and need-based grant supports students who are both academically excellent and actively involved in impactful service initiatives. International students are welcome to apply. Special consideration will be given to applicants who have initiated or led community service projects demonstrating innovation and sustainability. We encourage those of Asian descent who meet the requirements to apply.",
        "gender": "Female",
        "gpa": 3.7,
        "hbcu": false,
        "international": true,
        "link": "https://www.example.com/communityservicegrant",
        "location": "Washington",
        "major": "Computer Science",
        "merit_based_aid": true,
        "need_based_aid": true,
        "race": [
            "Asian"
        ],
        "scholarship_name": "Community Service Grant"
    },
    {
        "amount": "12500.00",
        "classification": "Senior",
        "deadline": "05/2025",
        "description": "The Science and Innovation Scholarship supports outstanding male students pursuing Mathematics degrees in Arizona. Applicants must demonstrate a GPA of 2.7 or higher. This scholarship prioritizes innovation and problem-solving skills, seeking students who actively engage in research, independent projects, or entrepreneurial ventures. While not need or merit-based, preference will be given to applicants who demonstrate a commitment to applying their mathematical skills to address real-world challenges in fields such as renewable energy, sustainable agriculture, or data science. International students are encouraged to apply. Applicants who are of Asian, Hispanic, or Native American descent are encouraged to apply.",
        "gender": "Male",
        "gpa": 2.7,
        "hbcu": false,
        "international": true,
        "link": "https://www.azsciinnovscholar.org/apply",
        "location": "Arizona",
        "major": "Mathematics",
        "merit_based_aid": false,
        "need_based_aid": false,
        "race": [
            "Asian",
            "Hispanic",
            "Native American"
        ],
        "scholarship_name": "Science and Innovation Scholarship"
    },
    {
        "amount": "5000.00",
        "classification": "Sophomore",
        "deadline": "11/2025",
        "description": "The Creative Minds Grant supports outstanding sophomore students in Michigan pursuing a Biology degree. This grant recognizes students demonstrating academic excellence and a passion for innovation within the field of biology. Applicants should submit a research proposal outlining their innovative approach to a biological problem. Special consideration will be given to projects addressing local environmental challenges in Michigan.",
        "gender": "Any",
        "gpa": 2.9,
        "hbcu": true,
        "international": false,
        "link": "https://www.exampleuniversity.edu/creativemindsgrant",
        "location": "Michigan",
        "major": "Biology",
        "merit_based_aid": false,
        "need_based_aid": false,
        "race": [
            "Black",
            "Asian"
        ],
        "scholarship_name": "Creative Minds Grant"
    },
    {
        "amount": "15000.00",
        "classification": "Sophomore",
        "deadline": "09/2025",
        "description": "The Trailblazer Grant is awarded to exceptional male sophomore students pursuing Engineering degrees in Arizona. Applicants must demonstrate a strong academic record (minimum 3.4 GPA) and a commitment to innovation in their field. This merit-based scholarship prioritizes students who are actively involved in community service, especially initiatives that promote environmental sustainability and STEM education. Black, Asian, and students of other races are encouraged to apply. Special consideration will be given to students who present novel engineering solutions addressing local challenges in Arizona.",
        "gender": "Male",
        "gpa": 3.4,
        "hbcu": true,
        "international": false,
        "link": "https://www.example.com/trailblazergrant",
        "location": "Arizona",
        "major": "Engineering",
        "merit_based_aid": true,
        "need_based_aid": false,
        "race": [
            "Black",
            "Other",
            "Asian"
        ],
        "scholarship_name": "Trailblazer Grant"
    },
    {
        "amount": "12500.00",
        "classification": "Sophomore",
        "deadline": "04/2025",
        "description": "The Youth Leadership Award recognizes young men in Ohio who demonstrate exceptional leadership potential and commitment to community service. Applicants must be male sophomores with a GPA of 3.8 or higher and pursuing a degree in Computer Science. This scholarship prioritizes innovation and problem-solving skills, with a focus on applicants involved in projects that leverage technology to address local or global challenges. We encourage applications from international students and those with diverse racial and ethnic backgrounds. Special consideration will be given to students who are active members of STEM-related clubs or organizations and can demonstrate a passion for creating positive change through technology.",
        "gender": "Male",
        "gpa": 3.8,
        "hbcu": true,
        "international": true,
        "link": "https://www.ohioleadershipfoundation.org/yla-apply",
        "location": "Ohio",
        "major": "Computer Science",
        "merit_based_aid": true,
        "need_based_aid": false,
        "race": [
            "Other",
            "Hispanic",
            "Native American"
        ],
        "scholarship_name": "Youth Leadership Award"
    },
    {
        "amount": "12500.00",
        "classification": "Sophomore",
        "deadline": "12/2025",
        "description": "The Diversity and Inclusion Scholarship supports outstanding female students pursuing a Business major in Pennsylvania. Applicants must maintain a minimum GPA of 3.0 and demonstrate financial need. Special consideration will be given to students who identify as Black or another underrepresented race. We focus on fostering leadership and innovation within the business sector and promoting diversity in the workplace.",
        "gender": "Female",
        "gpa": 3.0,
        "hbcu": false,
        "international": false,
        "link": "https://www.example.com/diversity-inclusion-scholarship",
        "location": "Pennsylvania",
        "major": "Business",
        "merit_based_aid": false,
        "need_based_aid": true,
        "race": [
            "Other",
            "Black"
        ],
        "scholarship_name": "Diversity and Inclusion Scholarship"
    },
    {
        "amount": "5000.00",
        "classification": "Sophomore",
        "deadline": "10/2025",
        "description": "The Impact Makers Scholarship supports outstanding sophomore students dedicated to making a tangible difference in their communities. Applicants must be enrolled full-time in a bachelor's degree program and maintain a minimum GPA of 2.7. This scholarship prioritizes students who demonstrate exceptional leadership skills and a commitment to innovation, particularly in addressing social challenges. Special consideration will be given to students who have launched their own initiatives or actively participate in community-based organizations. Students pursuing a major in History are particularly encouraged to apply.",
        "gender": "Male",
        "gpa": 2.7,
        "hbcu": false,
        "international": false,
        "link": "https://www.impactmakersfund.org/scholarships/apply",
        "location": "New York",
        "major": "History",
        "merit_based_aid": true,
        "need_based_aid": false,
        "race": [
            "Native American",
            "Other"
        ],
        "scholarship_name": "Impact Makers Scholarship"
    },
    {
        "amount": "15000.00",
        "classification": "Freshman",
        "deadline": "12/2025",
        "description": "The Artistic Vision Award recognizes female-identifying students with a passion for History and a commitment to using their historical knowledge to create a better future. Applicants must be incoming freshmen with a minimum GPA of 2.6 and demonstrate academic excellence and innovative thinking. International students are encouraged to apply. This award places special emphasis on applicants who showcase how their understanding of history informs their artistic or creative endeavors, aiming to inspire positive change in their communities and the world.",
        "gender": "Female",
        "gpa": 2.6,
        "hbcu": false,
        "international": true,
        "link": "https://www.artisticvisionaward.org",
        "location": "Georgia",
        "major": "History",
        "merit_based_aid": true,
        "need_based_aid": false,
        "race": [
            "Other",
            "Asian",
            "Native American"
        ],
        "scholarship_name": "Artistic Vision Award"
    },
    {
        "amount": "7500.00",
        "classification": "Any",
        "deadline": "08/2025",
        "description": "The Excellence in Innovation Scholarship aims to support ambitious female students pursuing higher education in Michigan. Applicants should demonstrate academic excellence with a minimum GPA of 3.5 and a passion for innovative solutions in their chosen field. This scholarship is open to both domestic and international students. Special consideration will be given to students from underrepresented racial backgrounds, including Black and Native American students, as well as those demonstrating financial need. Successful candidates will showcase a commitment to community service and a strong potential for leadership. HBCU students are encouraged to apply. The ideal candidate will articulate how they plan to use their education to drive positive change and create innovative solutions for global challenges. A creative project highlighting their innovative skills is a plus.",
        "gender": "Female",
        "gpa": 3.5,
        "hbcu": true,
        "international": true,
        "link": "https://www.innovation-scholars.org/apply",
        "location": "Michigan",
        "major": "",
        "merit_based_aid": true,
        "need_based_aid": true,
        "race": [
            "Black",
            "Native American",
            "Other"
        ],
        "scholarship_name": "Excellence in Innovation Scholarship"
    },
    {
        "amount": "5000.00",
        "classification": "Any",
        "deadline": "03/2025",
        "description": "The Academic Excellence Award recognizes Native American students in Arizona who demonstrate exceptional academic achievement and a commitment to their community. Applicants must maintain a GPA of 3.3 or higher and be enrolled in a full-time undergraduate program. Special consideration will be given to students involved in tribal preservation efforts, environmental sustainability initiatives, or innovative projects benefiting their community. This scholarship supports both merit and international students.",
        "gender": "Any",
        "gpa": 3.3,
        "hbcu": true,
        "international": true,
        "link": "https://www.azscholarships.org/academic-excellence-award",
        "location": "Arizona",
        "major": "",
        "merit_based_aid": true,
        "need_based_aid": false,
        "race": [
            "Native American"
        ],
        "scholarship_name": "Academic Excellence Award"
    },
    {
        "amount": "10000.00",
        "classification": "Freshman",
        "deadline": "11/2025",
        "description": "The Community Leadership Scholarship recognizes outstanding high school seniors entering their freshman year of college who have demonstrated exceptional leadership qualities and a commitment to service within their communities. Applicants must have a minimum GPA of 3.4 and be pursuing a degree in Engineering. While all students are encouraged to apply, preference will be given to students of Native American, Hispanic, and Asian descent. This scholarship also supports international students. The ideal candidate will demonstrate a passion for innovation, and possess a clear vision for how they will continue to contribute positively to their community and the world at large during their college years and beyond. Academic excellence is also considered.",
        "gender": "Any",
        "gpa": 3.4,
        "hbcu": false,
        "international": true,
        "link": "https://www.example.com/communityleadershipscholarship",
        "location": "New York",
        "major": "Engineering",
        "merit_based_aid": true,
        "need_based_aid": false,
        "race": [
            "Native American",
            "Hispanic",
            "Asian"
        ],
        "scholarship_name": "Community Leadership Scholarship"
    },
    {
        "amount": "7500.00",
        "classification": "Sophomore",
        "deadline": "10/2025",
        "description": "The Pioneering Spirit Grant supports undergraduate students with exceptional artistic talent and a demonstrated commitment to community engagement through their art. Applicants must maintain a GPA of 3.8 or higher and be enrolled full-time in an accredited Arts program. Special consideration will be given to applicants whose artwork addresses social justice issues or promotes environmental sustainability. International students are welcome to apply.  This grant recognizes and fosters the innovative spirit in young artists who are making a difference.",
        "gender": "Any",
        "gpa": 3.8,
        "hbcu": false,
        "international": true,
        "link": "https://www.exampleartsfoundation.org/pioneeringspiritgrant",
        "location": "New York",
        "major": "Arts",
        "merit_based_aid": true,
        "need_based_aid": false,
        "race": [
            "Native American",
            "Other"
        ],
        "scholarship_name": "Pioneering Spirit Grant"
    },
    {
        "amount": "7500.00",
        "classification": "Any",
        "deadline": "04/2025",
        "description": "The Community Service Grant recognizes students with a strong commitment to serving their communities. Applicants must have a minimum GPA of 3.5 and demonstrate active involvement in community service initiatives. Special consideration will be given to Native American students pursuing degrees in Mathematics. International students are welcome to apply. This grant emphasizes leadership and innovation within community projects, rewarding those who create impactful and sustainable change.",
        "gender": "Any",
        "gpa": 3.5,
        "hbcu": true,
        "international": true,
        "link": "https://www.example.com/communityservicegrant",
        "location": "Pennsylvania",
        "major": "Mathematics",
        "merit_based_aid": false,
        "need_based_aid": false,
        "race": [
            "Native American"
        ],
        "scholarship_name": "Community Service Grant"
    },
    {
        "amount": "5000.00",
        "classification": "Sophomore",
        "deadline": "12/2025",
        "description": "The Youth Leadership Award recognizes outstanding sophomore students in Michigan who demonstrate exceptional leadership qualities and a commitment to community service. Applicants must have a minimum GPA of 3.7 and be pursuing a degree in Business. This scholarship specifically supports male students who have shown initiative in leading community projects and possess strong communication skills. International students are encouraged to apply. While not need or merit-based, successful applicants will be those who articulate a clear vision for future leadership contributions and propose innovative solutions to contemporary business challenges within their communities. Preference is given to students of Other or Black race.",
        "gender": "Male",
        "gpa": 3.7,
        "hbcu": false,
        "international": true,
        "link": "https://www.example.com/youthleadershipaward",
        "location": "Michigan",
        "major": "Business",
        "merit_based_aid": false,
        "need_based_aid": false,
        "race": [
            "Other",
            "Black"
        ],
        "scholarship_name": "Youth Leadership Award"
    },
    {
        "amount": "15000.00",
        "classification": "Freshman",
        "deadline": "07/2025",
        "description": "The Educational Trailblazer Scholarship is designed to support exceptional female students of Hispanic or other underrepresented racial backgrounds pursuing a degree in History. Applicants must demonstrate financial need and a commitment to academic excellence. Special consideration will be given to candidates who exhibit strong leadership potential and innovative ideas for preserving and promoting historical awareness within their communities. International students are encouraged to apply. We value applicants who demonstrate resilience, determination, and a clear vision for their future contributions to the field of History.",
        "gender": "Female",
        "gpa": 3.1,
        "hbcu": false,
        "international": true,
        "link": "https://www.example.com/educationaltrailblazer",
        "location": "Ohio",
        "major": "History",
        "merit_based_aid": false,
        "need_based_aid": true,
        "race": [
            "Hispanic",
            "Other"
        ],
        "scholarship_name": "Educational Trailblazer Scholarship"
    },
    {
        "amount": "7500.00",
        "classification": "Sophomore",
        "deadline": "04/2025",
        "description": "The Visionary Impact Award recognizes sophomore students in California who demonstrate exceptional creativity and artistic talent. Applicants must have a minimum GPA of 3.5 and be pursuing a major within the Arts. International students are welcome to apply. Special consideration will be given to applicants showcasing innovative approaches to art that address social issues or promote environmental sustainability. This merit-based scholarship aims to support the next generation of artists making a difference. Students from Other, Hispanic, and Asian racial backgrounds are encouraged to apply.",
        "gender": "Any",
        "gpa": 3.5,
        "hbcu": false,
        "international": true,
        "link": "https://www.exampleartsfoundation.org/visionary-impact-award",
        "location": "California",
        "major": "Arts",
        "merit_based_aid": true,
        "need_based_aid": false,
        "race": [
            "Other",
            "Hispanic",
            "Asian"
        ],
        "scholarship_name": "Visionary Impact Award"
    },
    {
        "amount": "10000.00",
        "classification": "Senior",
        "deadline": "03/2025",
        "description": "The Social Impact Scholarship supports outstanding senior students in California pursuing a Business major who demonstrate a commitment to creating positive change in their communities. Applicants must have a minimum GPA of 3.4 and demonstrate financial need. This merit-based scholarship recognizes students excelling in academic performance and leadership, particularly those initiating innovative projects addressing social, economic, or environmental challenges. Special consideration will be given to students involved in community service initiatives and who identify as Hispanic or another underrepresented race. The selection committee will review the applications and consider the applicant's essay, academic transcripts, letters of recommendation, and financial documentation.",
        "gender": "Any",
        "gpa": 3.4,
        "hbcu": false,
        "international": false,
        "link": "https://www.socialimpactscholarships.org/apply",
        "location": "California",
        "major": "Business",
        "merit_based_aid": true,
        "need_based_aid": true,
        "race": [
            "Hispanic",
            "Other"
        ],
        "scholarship_name": "Social Impact Scholarship"
    },
    {
        "amount": "7500.00",
        "classification": "Junior",
        "deadline": "06/2025",
        "description": "The Innovation Catalyst Scholarship seeks to empower the next generation of problem-solvers and creative thinkers. Eligibility requires a minimum GPA of 3.0 and enrollment as a Junior in a Mathematics program at an accredited Arizona university. This merit-based scholarship places special emphasis on students demonstrating exceptional innovation through independent projects, research initiatives, or entrepreneurial ventures that solve real-world problems. Native American and Black students are encouraged to apply. Successful applicants will exhibit a strong academic record and a clear passion for applying mathematical principles to create innovative solutions.",
        "gender": "Male",
        "gpa": 3.0,
        "hbcu": false,
        "international": false,
        "link": "https://www.azinnovatescholars.org/apply",
        "location": "Arizona",
        "major": "Mathematics",
        "merit_based_aid": true,
        "need_based_aid": false,
        "race": [
            "Native American",
            "Black"
        ],
        "scholarship_name": "Innovation Catalyst Scholarship"
    },
    {
        "amount": "15000.00",
        "classification": "Junior",
        "deadline": "12/2025",
        "description": "The Visionary Impact Award recognizes outstanding junior-level students majoring in History who demonstrate a commitment to using historical knowledge to shape a better future. Applicants must maintain a minimum GPA of 3.2 and exhibit a strong passion for community service and civic engagement. Special consideration will be given to students who have initiated or actively participated in projects promoting historical preservation or education within their communities. This scholarship values innovative approaches to interpreting and sharing history.",
        "gender": "Any",
        "gpa": 3.2,
        "hbcu": false,
        "international": false,
        "link": "https://www.visionaryimpactaward.org/apply",
        "location": "Washington",
        "major": "History",
        "merit_based_aid": true,
        "need_based_aid": true,
        "race": [
            "Hispanic",
            "Other",
            "Native American"
        ],
        "scholarship_name": "Visionary Impact Award"
    },
    {
        "amount": "15000.00",
        "classification": "Junior",
        "deadline": "09/2025",
        "description": "The Cultural Enrichment Award supports outstanding junior students pursuing Mathematics degrees in Georgia. This scholarship recognizes individuals who demonstrate academic excellence and a commitment to promoting cultural understanding within their communities. Applicants must have a minimum GPA of 3.3. Special consideration will be given to male students actively involved in cultural exchange programs or initiatives that celebrate diversity through arts, community service, or innovative projects. Open to both domestic and international students.",
        "gender": "Male",
        "gpa": 3.3,
        "hbcu": true,
        "international": true,
        "link": "https://www.culturalenrichmentaward.org/apply",
        "location": "Georgia",
        "major": "Mathematics",
        "merit_based_aid": false,
        "need_based_aid": false,
        "race": [
            "Asian",
            "Other",
            "Black"
        ],
        "scholarship_name": "Cultural Enrichment Award"
    },
    {
        "amount": "12500.00",
        "classification": "Senior",
        "deadline": "07/2025",
        "description": "The STEM Excellence Scholarship recognizes outstanding senior students in Illinois pursuing degrees in Engineering. Applicants must demonstrate academic excellence with a minimum GPA of 2.8 and a commitment to innovation in their chosen field. This scholarship emphasizes leadership and impactful contributions within the STEM community. Preference will be given to students involved in research or projects with real-world applications. Native American and students who identify as Other are encouraged to apply.",
        "gender": "Any",
        "gpa": 2.8,
        "hbcu": false,
        "international": false,
        "link": "https://www.stemscholarships.org/stemexcellence",
        "location": "Illinois",
        "major": "Engineering",
        "merit_based_aid": true,
        "need_based_aid": false,
        "race": [
            "Native American",
            "Other"
        ],
        "scholarship_name": "STEM Excellence Scholarship"
    },
    {
        "amount": "7500.00",
        "classification": "Any",
        "deadline": "12/2025",
        "description": "The Next Gen Innovators Scholarship supports female-identifying students pursuing degrees in Engineering who demonstrate exceptional academic achievement, a commitment to innovation, and a passion for using their skills to create positive change in their communities. Applicants must have a minimum GPA of 3.6 and identify as Native American. Special consideration will be given to students with projects focusing on sustainable solutions and those who show leadership potential within STEM fields. Both merit and financial need are considered.",
        "gender": "Female",
        "gpa": 3.6,
        "hbcu": true,
        "international": false,
        "link": "https://www.example.com/nextgeninnovators",
        "location": "Florida",
        "major": "Engineering",
        "merit_based_aid": true,
        "need_based_aid": true,
        "race": [
            "Native American"
        ],
        "scholarship_name": "Next Gen Innovators Scholarship"
    },
    {
        "amount": "12500.00",
        "classification": "Junior",
        "deadline": "10/2025",
        "description": "The Social Impact Scholarship recognizes outstanding junior students in Georgia who are dedicated to making a positive impact on their communities. Applicants must maintain a minimum GPA of 2.6 and demonstrate a commitment to social change through community service, innovation, or environmental sustainability. This scholarship prioritizes students from underrepresented backgrounds, including Black and Native American students, and is open to both domestic and international students. Special consideration will be given to applicants who have overcome significant obstacles to pursue their educational goals. Both merit and need are considered.",
        "gender": "Any",
        "gpa": 2.6,
        "hbcu": true,
        "international": true,
        "link": "https://www.socialimpactscholarships.org/apply",
        "location": "Georgia",
        "major": "",
        "merit_based_aid": true,
        "need_based_aid": true,
        "race": [
            "Black",
            "Native American"
        ],
        "scholarship_name": "Social Impact Scholarship"
    },
    {
        "amount": "7500.00",
        "classification": "Freshman",
        "deadline": "05/2025",
        "description": "The Humanitarian Impact Award recognizes male freshman students in Texas pursuing Computer Science who demonstrate a commitment to using technology for social good. Applicants should have a minimum GPA of 3.1. This scholarship supports students from Native American and Hispanic backgrounds, and international students are encouraged to apply. Special consideration will be given to projects that address community needs through innovative tech solutions.",
        "gender": "Male",
        "gpa": 3.1,
        "hbcu": true,
        "international": true,
        "link": "https://www.example.com/humanitarian-impact-award",
        "location": "Texas",
        "major": "Computer Science",
        "merit_based_aid": false,
        "need_based_aid": false,
        "race": [
            "Native American",
            "Hispanic"
        ],
        "scholarship_name": "Humanitarian Impact Award"
    },
    {
        "amount": "15000.00",
        "classification": "Any",
        "deadline": "10/2025",
        "description": "The Creative Minds Grant supports Black students pursuing degrees in the Arts. Applicants should demonstrate exceptional talent and a commitment to using their artistic skills to promote positive change in their communities. This scholarship prioritizes students who explore themes of cultural identity and social justice through their art. A portfolio submission and personal essay are required.",
        "gender": "Any",
        "gpa": 3.3,
        "hbcu": true,
        "international": false,
        "link": "https://www.exampleartsfoundation.org/creativemindsgrant",
        "location": "Arizona",
        "major": "Arts",
        "merit_based_aid": false,
        "need_based_aid": false,
        "race": [
            "Black"
        ],
        "scholarship_name": "Creative Minds Grant"
    },
    {
        "amount": "7500.00",
        "classification": "Sophomore",
        "deadline": "11/2025",
        "description": "The Future Innovators Award recognizes outstanding male sophomore students in Texas pursuing Computer Science degrees who demonstrate a passion for innovation and academic excellence. Applicants must have a minimum GPA of 2.5 and should showcase their innovative projects, whether in software development, AI, or other related fields. Special consideration will be given to applicants who have contributed to open-source projects or have participated in hackathons. While not need-based, this scholarship values merit and the potential to contribute to the future of technology. We encourage students of Asian and Hispanic descent to apply.",
        "gender": "Male",
        "gpa": 2.5,
        "hbcu": false,
        "international": false,
        "link": "https://www.example.com/futureinnovatorsaward",
        "location": "Texas",
        "major": "Computer Science",
        "merit_based_aid": true,
        "need_based_aid": false,
        "race": [
            "Asian",
            "Hispanic"
        ],
        "scholarship_name": "Future Innovators Award"
    },
    {
        "amount": "12500.00",
        "classification": "Any",
        "deadline": "10/2025",
        "description": "The Technology Leadership Award recognizes male students of Asian or other descent pursuing Biology degrees at Arizona universities who demonstrate exceptional academic achievement and a commitment to innovation in their field. Applicants must maintain a minimum GPA of 3.5 and exhibit leadership potential through extracurricular activities, research projects, or community involvement. This scholarship specifically targets students who aspire to leverage technology to advance biological research or address critical challenges in healthcare and environmental sustainability. Merit-based, this award prioritizes students with a strong record of academic excellence and innovative thinking.",
        "gender": "Male",
        "gpa": 3.5,
        "hbcu": false,
        "international": false,
        "link": "https://www.aztechscholars.org/apply/tech-leadership-award",
        "location": "Arizona",
        "major": "Biology",
        "merit_based_aid": true,
        "need_based_aid": false,
        "race": [
            "Asian",
            "Other"
        ],
        "scholarship_name": "Technology Leadership Award"
    },
    {
        "amount": "5000.00",
        "classification": "Sophomore",
        "deadline": "10/2025",
        "description": "The Digital Transformation Grant supports promising Business majors in Massachusetts who demonstrate academic excellence and a passion for leveraging technology to solve real-world problems. Applicants should have a minimum GPA of 2.6. This grant prioritizes students with innovative ideas for applying digital solutions to improve business processes, enhance customer experience, or create new market opportunities. Community service or extracurricular activities related to technology are highly valued. This scholarship is unique because it includes mentorship from industry leaders in the digital transformation space.",
        "gender": "Male",
        "gpa": 2.6,
        "hbcu": false,
        "international": false,
        "link": "https://www.digitaltransformationgrant.org/apply",
        "location": "Massachusetts",
        "major": "Business",
        "merit_based_aid": true,
        "need_based_aid": true,
        "race": [
            "Other",
            "Hispanic"
        ],
        "scholarship_name": "Digital Transformation Grant"
    },
    {
        "amount": "7500.00",
        "classification": "Freshman",
        "deadline": "03/2025",
        "description": "The Future Innovators Award is a prestigious scholarship designed to support ambitious female freshman students pursuing higher education in North Carolina. Eligibility requires a minimum GPA of 3.2. This scholarship is open to international students and encourages applications from Native American, Asian, and other underrepresented racial backgrounds. While academic merit is considered, emphasis is placed on need-based aid. Successful applicants will demonstrate a passion for innovation, particularly in areas related to environmental sustainability and technology. Special consideration will be given to applicants who have participated in STEM-related extracurricular activities or have demonstrated leadership in promoting environmental awareness within their communities.",
        "gender": "Female",
        "gpa": 3.2,
        "hbcu": true,
        "international": true,
        "link": "https://www.example.com/futureinnovatorsaward",
        "location": "North Carolina",
        "major": "",
        "merit_based_aid": false,
        "need_based_aid": true,
        "race": [
            "Other",
            "Native American",
            "Asian"
        ],
        "scholarship_name": "Future Innovators Award"
    },
    {
        "amount": "5000.00",
        "classification": "Sophomore",
        "deadline": "07/2025",
        "description": "The Educational Trailblazer Scholarship supports male sophomore students in Georgia who are pursuing a degree in Engineering. Applicants must demonstrate a GPA of 2.5 or higher and show a commitment to innovation and community service. International students are encouraged to apply. This scholarship values academic excellence and leadership potential, seeking students who aim to make a significant impact in their field.",
        "gender": "Male",
        "gpa": 2.5,
        "hbcu": false,
        "international": true,
        "link": "https://www.example.com/educational-trailblazer-scholarship",
        "location": "Georgia",
        "major": "Engineering",
        "merit_based_aid": true,
        "need_based_aid": true,
        "race": [
            "Asian"
        ],
        "scholarship_name": "Educational Trailblazer Scholarship"
    },
    {
        "amount": "12500.00",
        "classification": "Freshman",
        "deadline": "11/2025",
        "description": "The Breakthrough Innovators Scholarship seeks to support exceptional female students from Ohio pursuing Mathematics degrees who demonstrate both academic excellence and a passion for innovative problem-solving. Applicants must have a minimum GPA of 3.7 and demonstrate financial need. Special consideration will be given to students with a background in underrepresented racial/ethnic groups (Hispanic, Native American, or Other). This scholarship recognizes potential in mathematics and innovation.",
        "gender": "Female",
        "gpa": 3.7,
        "hbcu": true,
        "international": false,
        "link": "https://www.innovateohioscholarships.org/breakthrough-innovators",
        "location": "Ohio",
        "major": "Mathematics",
        "merit_based_aid": false,
        "need_based_aid": true,
        "race": [
            "Other",
            "Hispanic",
            "Native American"
        ],
        "scholarship_name": "Breakthrough Innovators Scholarship"
    },
    {
        "amount": "5000.00",
        "classification": "Sophomore",
        "deadline": "10/2025",
        "description": "The Academic Excellence Award recognizes sophomore students in Massachusetts pursuing a degree in History who demonstrate exceptional academic achievement. Applicants must have a minimum GPA of 3.5. This merit-based scholarship places emphasis on critical thinking, research abilities, and a passion for historical study. Black and Native American students are encouraged to apply. The selection committee will favor students who display innovative approaches to historical analysis and a commitment to preserving historical narratives.",
        "gender": "Male",
        "gpa": 3.5,
        "hbcu": false,
        "international": false,
        "link": "https://www.academicexcellenceawards.org/apply",
        "location": "Massachusetts",
        "major": "History",
        "merit_based_aid": true,
        "need_based_aid": false,
        "race": [
            "Black",
            "Native American"
        ],
        "scholarship_name": "Academic Excellence Award"
    },
    {
        "amount": "10000.00",
        "classification": "Sophomore",
        "deadline": "11/2025",
        "description": "The Emerging Leaders Award recognizes sophomore students in Pennsylvania who demonstrate exceptional leadership potential and a commitment to innovation. Applicants must be pursuing a degree in Engineering, maintain a GPA of 2.8 or higher, and be actively involved in extracurricular activities. This scholarship is open to students of all genders and is particularly aimed at fostering diverse voices in the field of engineering. International students and those attending Historically Black Colleges and Universities (HBCUs) are encouraged to apply. While academic achievement is important, emphasis will be placed on demonstrated leadership skills and innovative project proposals addressing real-world challenges. Students from Other, Black, and Native American racial backgrounds are especially encouraged to apply.",
        "gender": "Any",
        "gpa": 2.8,
        "hbcu": true,
        "international": true,
        "link": "https://www.paengineeringscholars.org/emergingleadersaward",
        "location": "Pennsylvania",
        "major": "Engineering",
        "merit_based_aid": false,
        "need_based_aid": false,
        "race": [
            "Other",
            "Black",
            "Native American"
        ],
        "scholarship_name": "Emerging Leaders Award"
    },
    {
        "amount": "15000.00",
        "classification": "Senior",
        "deadline": "03/2025",
        "description": "The Diversity and Inclusion Scholarship aims to support outstanding students from underrepresented backgrounds pursuing a Business degree. Eligibility requires a minimum GPA of 3.7 and demonstrated leadership within their community. This scholarship prioritizes applicants who have shown a commitment to promoting diversity and inclusion through volunteer work, extracurricular activities, or innovative projects. Both domestic and international students are eligible to apply, with a special emphasis on students attending or planning to attend an HBCU. Strong consideration will be given to students of Black or Hispanic descent.",
        "gender": "Any",
        "gpa": 3.7,
        "hbcu": true,
        "international": true,
        "link": "https://www.example.com/diversity-inclusion-scholarship",
        "location": "North Carolina",
        "major": "Business",
        "merit_based_aid": false,
        "need_based_aid": false,
        "race": [
            "Black",
            "Hispanic"
        ],
        "scholarship_name": "Diversity and Inclusion Scholarship"
    },
    {
        "amount": "12500.00",
        "classification": "Junior",
        "deadline": "07/2025",
        "description": "The Community Service Grant recognizes outstanding junior-level male students in Georgia who demonstrate a commitment to community involvement and academic excellence, specifically in the field of History. Applicants must maintain a minimum GPA of 3.6 and be either of Hispanic or Black descent. This grant is also open to international students. While academic performance is important, the primary focus is on impactful community service initiatives. Strong consideration will be given to applicants involved in historical preservation projects or initiatives promoting civic engagement within their communities. The selection committee values leadership qualities and a passion for making a tangible difference.",
        "gender": "Male",
        "gpa": 3.6,
        "hbcu": false,
        "international": true,
        "link": "https://www.georgiacommunityfoundation.org/community-service-grant",
        "location": "Georgia",
        "major": "History",
        "merit_based_aid": true,
        "need_based_aid": false,
        "race": [
            "Hispanic",
            "Black"
        ],
        "scholarship_name": "Community Service Grant"
    },
    {
        "amount": "12500.00",
        "classification": "Senior",
        "deadline": "04/2025",
        "description": "The Future Changemakers Award recognizes outstanding male senior students in North Carolina who demonstrate a commitment to innovation and positive social impact. Applicants should be pursuing a degree in Biology and have a minimum GPA of 2.8. This scholarship is specifically designed for international students from Asian, Black, or Other racial backgrounds. The ideal candidate will be involved in community initiatives and display a passion for environmental sustainability through innovative solutions.",
        "gender": "Male",
        "gpa": 2.8,
        "hbcu": false,
        "international": true,
        "link": "https://futurechangemakers.org/apply",
        "location": "North Carolina",
        "major": "Biology",
        "merit_based_aid": false,
        "need_based_aid": false,
        "race": [
            "Asian",
            "Black",
            "Other"
        ],
        "scholarship_name": "Future Changemakers Award"
    },
    {
        "amount": "7500.00",
        "classification": "Freshman",
        "deadline": "09/2025",
        "description": "The Tech Pioneers Scholarship aims to support young women pursuing engineering degrees who demonstrate a passion for innovation and a commitment to using technology for social good. Applicants must be female, a resident of Arizona, and have a minimum GPA of 2.7. Special consideration will be given to applicants who have participated in STEM-related extracurricular activities or volunteer work, particularly those benefiting underserved communities. Black students are highly encouraged to apply.",
        "gender": "Female",
        "gpa": 2.7,
        "hbcu": true,
        "international": false,
        "link": "https://www.techpioneersfund.org/scholarships/apply",
        "location": "Arizona",
        "major": "Engineering",
        "merit_based_aid": false,
        "need_based_aid": false,
        "race": [
            "Black"
        ],
        "scholarship_name": "Tech Pioneers Scholarship"
    },
    {
        "amount": "10000.00",
        "classification": "Freshman",
        "deadline": "06/2025",
        "description": "The Diversity and Inclusion Scholarship supports incoming freshmen from underrepresented backgrounds pursuing STEM fields. Applicants must demonstrate academic excellence with a minimum GPA of 3.2 and a commitment to community service. Special consideration will be given to students who have shown leadership in promoting diversity initiatives within their schools or communities and are residents of North Carolina.",
        "gender": "Male",
        "gpa": 3.2,
        "hbcu": false,
        "international": false,
        "link": "https://www.example.com/diversity-inclusion-scholarship",
        "location": "North Carolina",
        "major": "Mathematics",
        "merit_based_aid": true,
        "need_based_aid": true,
        "race": [
            "Native American"
        ],
        "scholarship_name": "Diversity and Inclusion Scholarship"
    },
    {
        "amount": "7500.00",
        "classification": "Sophomore",
        "deadline": "07/2025",
        "description": "The Future Changemakers Award recognizes outstanding sophomore male students in Florida pursuing a degree in Biology who demonstrate a commitment to innovation and community leadership. Applicants must have a minimum GPA of 3.2 and be either Native American or Black. International students are encouraged to apply. This merit-based scholarship prioritizes students who are developing innovative solutions for environmental sustainability within their communities. Special consideration will be given to those involved in scientific research related to local Florida ecosystems.",
        "gender": "Male",
        "gpa": 3.2,
        "hbcu": false,
        "international": true,
        "link": "https://www.example.com/futurechangemakersaward",
        "location": "Florida",
        "major": "Biology",
        "merit_based_aid": true,
        "need_based_aid": false,
        "race": [
            "Native American",
            "Black"
        ],
        "scholarship_name": "Future Changemakers Award"
    },
    {
        "amount": "7500.00",
        "classification": "Any",
        "deadline": "07/2025",
        "description": "The Cultural Enrichment Award is a need-based scholarship designed to support female students pursuing degrees in Engineering who demonstrate a commitment to promoting cultural awareness and understanding within their communities. Applicants must have a minimum GPA of 3.7 and identify as Black, Asian, or Native American. Special consideration will be given to students who are actively involved in cultural organizations or projects that bridge cultural divides. This scholarship aims to foster leadership and innovation in engineering, while also celebrating and valuing diverse perspectives.",
        "gender": "Female",
        "gpa": 3.7,
        "hbcu": true,
        "international": false,
        "link": "https://www.californiaengineringfound.org/culturalenrichmentaward",
        "location": "California",
        "major": "Engineering",
        "merit_based_aid": false,
        "need_based_aid": true,
        "race": [
            "Black",
            "Asian",
            "Native American"
        ],
        "scholarship_name": "Cultural Enrichment Award"
    },
    {
        "amount": "10000.00",
        "classification": "Sophomore",
        "deadline": "06/2025",
        "description": "The Visionary Impact Award recognizes sophomore students in California who demonstrate exceptional artistic talent and a commitment to using their art for social change. Applicants must have a GPA of 3.0 or higher and identify as Native American, Black, or Asian. This merit-based scholarship prioritizes students involved in community arts initiatives and those who showcase innovation in their artistic expression. HBCU students are strongly encouraged to apply. The award seeks to support visionary artists who are poised to make a significant impact on their communities through their creative endeavors.",
        "gender": "Male",
        "gpa": 3.0,
        "hbcu": true,
        "international": false,
        "link": "https://www.visionaryimpactaward.org/apply",
        "location": "California",
        "major": "Arts",
        "merit_based_aid": true,
        "need_based_aid": false,
        "race": [
            "Native American",
            "Black",
            "Asian"
        ],
        "scholarship_name": "Visionary Impact Award"
    },
    {
        "amount": "5000.00",
        "classification": "Freshman",
        "deadline": "08/2025",
        "description": "The Trailblazer Grant aims to support ambitious female students pursuing History degrees at universities in Michigan. Applicants should demonstrate academic excellence with a minimum GPA of 3.1 and a passion for historical research, especially focusing on underrepresented narratives. The grant places a strong emphasis on leadership and community involvement, particularly initiatives that promote historical awareness and civic engagement. Special consideration will be given to candidates who showcase innovative approaches to historical analysis and a commitment to making history accessible to a wider audience.",
        "gender": "Female",
        "gpa": 3.1,
        "hbcu": false,
        "international": false,
        "link": "https://www.example.com/trailblazergrant",
        "location": "Michigan",
        "major": "History",
        "merit_based_aid": true,
        "need_based_aid": true,
        "race": [
            "Other"
        ],
        "scholarship_name": "Trailblazer Grant"
    },
    {
        "amount": "5000.00",
        "classification": "Any",
        "deadline": "10/2025",
        "description": "The Digital Transformation Grant supports male students pursuing Arts degrees in Illinois who demonstrate financial need and are passionate about leveraging digital tools to enhance their artistic expression. Applicants must have a minimum GPA of 2.8. This grant prioritizes students exploring innovative applications of technology within their art form, such as digital art, animation, graphic design, or interactive media. Black students are encouraged to apply. The grant supports tuition, equipment, and software expenses related to digital art projects.",
        "gender": "Male",
        "gpa": 2.8,
        "hbcu": false,
        "international": false,
        "link": "https://www.digitalartsfoundation.org/grants/transformation-grant",
        "location": "Illinois",
        "major": "Arts",
        "merit_based_aid": false,
        "need_based_aid": true,
        "race": [
            "Black"
        ],
        "scholarship_name": "Digital Transformation Grant"
    },
    {
        "amount": "7500.00",
        "classification": "Sophomore",
        "deadline": "06/2025",
        "description": "The Excellence in Design Scholarship recognizes male sophomore students in Georgia who demonstrate exceptional academic achievement and a passion for innovation in the field of Business. Applicants must have a minimum GPA of 3.3 and identify as Asian. This scholarship also considers international students currently studying in Georgia. It emphasizes merit-based aid, rewarding those who strive for excellence. While need-based aid is not a factor, we highly value applicants involved in community service and leadership activities. HBCU students are encouraged to apply.",
        "gender": "Male",
        "gpa": 3.3,
        "hbcu": true,
        "international": true,
        "link": "https://www.exampledesignscholarships.org/apply",
        "location": "Georgia",
        "major": "Business",
        "merit_based_aid": true,
        "need_based_aid": false,
        "race": [
            "Asian"
        ],
        "scholarship_name": "Excellence in Design Scholarship"
    },
    {
        "amount": "7500.00",
        "classification": "Any",
        "deadline": "06/2025",
        "description": "The Community Leadership Scholarship recognizes outstanding students who demonstrate a commitment to serving their communities through volunteer work, activism, or other forms of civic engagement. Eligible applicants must maintain a minimum GPA of 3.0, be pursuing a degree in Mathematics, and be a resident of Washington state. This scholarship prioritizes students who have shown exceptional leadership skills in addressing local issues and initiatives related to environmental sustainability, social justice, or educational equity. Black, Native American, and students of Other races are encouraged to apply. Both need-based and merit-based aid is considered. International students attending universities in Washington are eligible.",
        "gender": "Any",
        "gpa": 3.0,
        "hbcu": true,
        "international": true,
        "link": "https://www.examplecommunityfoundation.org/community-leadership-scholarship",
        "location": "Washington",
        "major": "Mathematics",
        "merit_based_aid": true,
        "need_based_aid": true,
        "race": [
            "Black",
            "Other",
            "Native American"
        ],
        "scholarship_name": "Community Leadership Scholarship"
    },
    {
        "amount": "15000.00",
        "classification": "Junior",
        "deadline": "06/2025",
        "description": "The Next Generation Leaders Grant is designed to empower young men in Texas who demonstrate exceptional leadership potential and a commitment to making a positive impact on their communities. To be eligible, applicants must be male students classified as juniors at a Texas university, maintaining a GPA of 3.6 or higher. This scholarship places emphasis on academic excellence, leadership skills, and involvement in community service. Special consideration will be given to students pursuing degrees in Business and showcasing innovative ideas to address societal challenges. HBCU students and international students are encouraged to apply. Financial need will also be considered alongside merit.",
        "gender": "Male",
        "gpa": 3.6,
        "hbcu": true,
        "international": true,
        "link": "https://www.example.com/nextgenleadersgrant",
        "location": "Texas",
        "major": "Business",
        "merit_based_aid": true,
        "need_based_aid": true,
        "race": [
            "Asian",
            "Hispanic",
            "Native American"
        ],
        "scholarship_name": "Next Generation Leaders Grant"
    },
    {
        "amount": "5000.00",
        "classification": "Junior",
        "deadline": "06/2025",
        "description": "The Future Leaders Scholarship is awarded to outstanding junior students majoring in History at universities located in Massachusetts. Applicants must demonstrate a strong academic record (minimum 3.2 GPA) and a commitment to leadership within their community or university. International students are eligible. This merit-based scholarship places particular emphasis on applicants who have demonstrated innovation in their field of historical study, specifically those focusing on underrepresented narratives. Black and Asian students are encouraged to apply. The scholarship aims to support future leaders who will contribute meaningfully to the understanding and preservation of history.",
        "gender": "Any",
        "gpa": 3.2,
        "hbcu": false,
        "international": true,
        "link": "https://www.example.com/futureleadersscholarship",
        "location": "Massachusetts",
        "major": "History",
        "merit_based_aid": true,
        "need_based_aid": false,
        "race": [
            "Black",
            "Asian"
        ],
        "scholarship_name": "Future Leaders Scholarship"
    },
    {
        "amount": "12500.00",
        "classification": "Freshman",
        "deadline": "10/2025",
        "description": "The Digital Transformation Grant supports incoming female freshman students pursuing Biology degrees in Pennsylvania. Applicants should demonstrate academic excellence and a passion for leveraging digital tools to advance biological research or address environmental challenges. Special consideration will be given to students with innovative project proposals utilizing data analysis or biotechnology.",
        "gender": "Female",
        "gpa": 3.2,
        "hbcu": false,
        "international": false,
        "link": "https://www.exampleuniversity.edu/digitaltransformationgrant",
        "location": "Pennsylvania",
        "major": "Biology",
        "merit_based_aid": true,
        "need_based_aid": true,
        "race": [
            "Hispanic",
            "Asian",
            "Black"
        ],
        "scholarship_name": "Digital Transformation Grant"
    },
    {
        "amount": "5000.00",
        "classification": "Junior",
        "deadline": "10/2025",
        "description": "The Green Future Award recognizes outstanding junior-level students in Michigan who demonstrate a commitment to environmental sustainability through academic excellence and innovative projects. Applicants must have a minimum GPA of 3.1 and identify as Asian, Native American, or Black. This scholarship is open to international students. Special consideration will be given to those involved in community initiatives focused on renewable energy, conservation, and environmental education.",
        "gender": "Any",
        "gpa": 3.1,
        "hbcu": false,
        "international": true,
        "link": "https://www.example.com/greenfutureaward",
        "location": "Michigan",
        "major": "",
        "merit_based_aid": false,
        "need_based_aid": false,
        "race": [
            "Asian",
            "Native American",
            "Black"
        ],
        "scholarship_name": "Green Future Award"
    },
    {
        "amount": "12500.00",
        "classification": "Freshman",
        "deadline": "12/2025",
        "description": "The Artistic Vision Award celebrates incoming freshman students who demonstrate exceptional creativity and a commitment to using their artistic talents to address critical issues in the field of Biology. Eligibility requires a minimum GPA of 3.4 and acceptance into a Biology program at an accredited university in Illinois. This scholarship places emphasis on academic excellence and innovative approaches to scientific challenges. Special consideration will be given to students who showcase a unique perspective through art (visual, digital, or performance) to interpret or communicate biological concepts. Open to all genders, including international and HBCU students. We particularly encourage applications from students of Native American, Hispanic, and Black descent.",
        "gender": "Any",
        "gpa": 3.4,
        "hbcu": true,
        "international": true,
        "link": "https://www.artisticvisionscholars.org/apply",
        "location": "Illinois",
        "major": "Biology",
        "merit_based_aid": true,
        "need_based_aid": false,
        "race": [
            "Native American",
            "Hispanic",
            "Black"
        ],
        "scholarship_name": "Artistic Vision Award"
    },
    {
        "amount": "15000.00",
        "classification": "Freshman",
        "deadline": "12/2025",
        "description": "The Digital Transformation Grant supports female students pursuing a Biology major who demonstrate academic excellence and a passion for leveraging digital tools to advance scientific discovery. Applicants must have a minimum GPA of 2.5 and be international students studying in Massachusetts. This merit-based scholarship specifically targets students of Black or Asian descent who are committed to innovative research and aspire to integrate technology into biological studies. The grant prioritizes candidates with a strong interest in bioinformatics, computational biology, and related fields. Recipients are expected to participate in mentorship programs and contribute to ongoing digital transformation initiatives within their academic community.",
        "gender": "Female",
        "gpa": 2.5,
        "hbcu": false,
        "international": true,
        "link": "https://www.digitaltransformationgrant.org/apply",
        "location": "Massachusetts",
        "major": "Biology",
        "merit_based_aid": true,
        "need_based_aid": false,
        "race": [
            "Black",
            "Asian"
        ],
        "scholarship_name": "Digital Transformation Grant"
    },
    {
        "amount": "5000.00",
        "classification": "Any",
        "deadline": "04/2025",
        "description": "The Arts Excellence Grant supports talented male Engineering students in Michigan who demonstrate both financial need and a commitment to integrating artistic expression into their engineering studies. Applicants must have a minimum GPA of 2.7 and identify as Hispanic or Native American. The scholarship prioritizes students involved in community art projects or those who demonstrate innovative uses of technology in artistic endeavors. Special consideration will be given to applicants showcasing unique solutions to environmental challenges through art and engineering collaboration.",
        "gender": "Male",
        "gpa": 2.7,
        "hbcu": false,
        "international": false,
        "link": "https://www.artexcellence.org/apply",
        "location": "Michigan",
        "major": "Engineering",
        "merit_based_aid": false,
        "need_based_aid": true,
        "race": [
            "Hispanic",
            "Native American"
        ],
        "scholarship_name": "Arts Excellence Grant"
    },
    {
        "amount": "12500.00",
        "classification": "Junior",
        "deadline": "09/2025",
        "description": "The Tech Pioneers Scholarship aims to support underrepresented students pursuing tech-related fields at Michigan universities. Applicants must demonstrate financial need and a strong interest in using technology for social good. Special consideration will be given to students involved in community service or innovation projects that address local challenges. Eligibility requires a minimum GPA of 3.1 and residency in Michigan. This scholarship focuses on empowering future tech leaders to create impactful solutions within their communities.",
        "gender": "Any",
        "gpa": 3.1,
        "hbcu": true,
        "international": false,
        "link": "https://www.techpioneersfund.org/scholarships/apply",
        "location": "Michigan",
        "major": "",
        "merit_based_aid": false,
        "need_based_aid": true,
        "race": [
            "Asian",
            "Black",
            "Hispanic"
        ],
        "scholarship_name": "Tech Pioneers Scholarship"
    },
    {
        "amount": "7500.00",
        "classification": "Freshman",
        "deadline": "05/2025",
        "description": "The Educational Trailblazer Scholarship supports ambitious female students of Hispanic descent pursuing Biology degrees in Ohio. Applicants must demonstrate a strong academic record (GPA 3.6 or higher), a commitment to community service, and innovative thinking within the biological sciences, with an interest in international applications. International students are welcomed and encouraged to apply. This scholarship specifically targets students who may not qualify for traditional need-based aid but still require financial assistance to achieve their educational goals. Demonstrated leadership potential is highly valued.",
        "gender": "Female",
        "gpa": 3.6,
        "hbcu": true,
        "international": true,
        "link": "https://www.example.com/educationaltrailblazer",
        "location": "Ohio",
        "major": "Biology",
        "merit_based_aid": false,
        "need_based_aid": false,
        "race": [
            "Hispanic"
        ],
        "scholarship_name": "Educational Trailblazer Scholarship"
    },
    {
        "amount": "12500.00",
        "classification": "Sophomore",
        "deadline": "06/2025",
        "description": "The Next Gen Innovators Scholarship seeks to empower future female leaders in the field of Business. Applicants must be female students of Black descent, demonstrating academic excellence with a minimum GPA of 3.0, and currently classified as Sophomores. This scholarship particularly values innovation and entrepreneurial spirit. While not mandatory, preference will be given to candidates who showcase a strong commitment to community service and possess innovative business ideas. The scholarship supports students studying in New York.",
        "gender": "Female",
        "gpa": 3.0,
        "hbcu": false,
        "international": false,
        "link": "https://www.example.com/nextgeninnovators",
        "location": "New York",
        "major": "Business",
        "merit_based_aid": false,
        "need_based_aid": false,
        "race": [
            "Black"
        ],
        "scholarship_name": "Next Gen Innovators Scholarship"
    },
    {
        "amount": "10000.00",
        "classification": "Senior",
        "deadline": "07/2025",
        "description": "The Youth Leadership Award recognizes outstanding male high school seniors in Pennsylvania who have demonstrated exceptional leadership qualities and a commitment to community service. Applicants must have a minimum GPA of 2.8. This scholarship focuses on fostering innovation and environmental sustainability through student-led projects. International students are encouraged to apply. Special consideration will be given to applicants who have spearheaded initiatives resulting in tangible positive impacts within their communities, especially initiatives that are related to climate change. Merit and need will both be considered.",
        "gender": "Male",
        "gpa": 2.8,
        "hbcu": false,
        "international": true,
        "link": "https://www.example.com/youthleadershipaward",
        "location": "Pennsylvania",
        "major": "",
        "merit_based_aid": true,
        "need_based_aid": true,
        "race": [
            "Other"
        ],
        "scholarship_name": "Youth Leadership Award"
    },
    {
        "amount": "5000.00",
        "classification": "Sophomore",
        "deadline": "03/2025",
        "description": "The Civic Engagement Award recognizes students demonstrating exceptional commitment to civic responsibility and innovative problem-solving within their communities. Applicants must be full-time sophomores with a minimum GPA of 3.6 and pursuing a degree in Computer Science. This need-based scholarship prioritizes students actively involved in developing technological solutions to address social challenges, such as accessibility, environmental sustainability, or digital inclusion. International students are encouraged to apply. Special consideration will be given to applicants who can demonstrate the impact of their work through measurable outcomes and community testimonials.",
        "gender": "Any",
        "gpa": 3.6,
        "hbcu": false,
        "international": true,
        "link": "https://example.com/civic-engagement-award",
        "location": "Washington",
        "major": "Computer Science",
        "merit_based_aid": false,
        "need_based_aid": true,
        "race": [
            "Other",
            "Asian",
            "Native American"
        ],
        "scholarship_name": "Civic Engagement Award"
    },
    {
        "amount": "5000.00",
        "classification": "Freshman",
        "deadline": "05/2025",
        "description": "The Future Leaders Scholarship is designed to empower young Native American women pursuing a degree in Business. Applicants must demonstrate a strong commitment to their community, a dedication to academic excellence with a GPA of 3.5 or higher, and exhibit leadership potential. This need-based scholarship aims to support the next generation of female Native American business leaders making a difference in Washington state. International students are welcome to apply.",
        "gender": "Female",
        "gpa": 3.5,
        "hbcu": true,
        "international": true,
        "link": "https://www.example.com/futureleadersscholarship",
        "location": "Washington",
        "major": "Business",
        "merit_based_aid": false,
        "need_based_aid": true,
        "race": [
            "Native American"
        ],
        "scholarship_name": "Future Leaders Scholarship"
    },
    {
        "amount": "7500.00",
        "classification": "Senior",
        "deadline": "12/2025",
        "description": "The Inspirational Achievement Grant is designed to recognize and support outstanding Computer Science students who demonstrate a commitment to both academic excellence and innovative problem-solving. Applicants must have a minimum GPA of 2.5 and be pursuing a bachelor's degree in Computer Science. International students are welcome to apply. While not need-based, this scholarship places a strong emphasis on demonstrated leadership skills and innovative project development, especially those projects with potential for social impact or environmental sustainability. Students who identify as Asian or Other are encouraged to apply. Recipients will also be invited to present their work at an annual symposium.",
        "gender": "Any",
        "gpa": 2.5,
        "hbcu": false,
        "international": true,
        "link": "https://www.example.com/inspirational-achievement-grant",
        "location": "Washington",
        "major": "Computer Science",
        "merit_based_aid": true,
        "need_based_aid": false,
        "race": [
            "Asian",
            "Other"
        ],
        "scholarship_name": "Inspirational Achievement Grant"
    },
    {
        "amount": "10000.00",
        "classification": "Junior",
        "deadline": "08/2025",
        "description": "The Innovation Catalyst Scholarship supports female students of Native American or Other descent pursuing Computer Science degrees at universities in Texas. Applicants must maintain a minimum GPA of 3.0 and demonstrate a commitment to innovation through prior projects, research, or entrepreneurial endeavors. International students are welcome to apply. This scholarship specifically seeks individuals who are not only academically strong but also show exceptional promise in using technology to solve real-world problems, especially those facing underserved communities. While merit is considered, a strong emphasis is placed on the applicant's vision for leveraging technology for social good.",
        "gender": "Female",
        "gpa": 3.0,
        "hbcu": false,
        "international": true,
        "link": "https://www.example.com/innovationcatalystscholarship",
        "location": "Texas",
        "major": "Computer Science",
        "merit_based_aid": false,
        "need_based_aid": false,
        "race": [
            "Native American",
            "Other"
        ],
        "scholarship_name": "Innovation Catalyst Scholarship"
    },
    {
        "amount": "12500.00",
        "classification": "Sophomore",
        "deadline": "06/2025",
        "description": "The Trailblazer Grant supports ambitious female sophomores in Georgia pursuing Business degrees. Applicants should demonstrate academic excellence and a commitment to innovative problem-solving within their communities. Special consideration will be given to candidates who showcase leadership potential and a passion for environmental sustainability. Native American students and those of other underrepresented races are especially encouraged to apply.",
        "gender": "Female",
        "gpa": 3.6,
        "hbcu": true,
        "international": true,
        "link": "https://www.example.com/trailblazergrant",
        "location": "Georgia",
        "major": "Business",
        "merit_based_aid": false,
        "need_based_aid": false,
        "race": [
            "Native American",
            "Other"
        ],
        "scholarship_name": "Trailblazer Grant"
    },
    {
        "amount": "7500.00",
        "classification": "Any",
        "deadline": "04/2025",
        "description": "The Innovation in Action Award supports History majors who demonstrate a commitment to applying historical knowledge to contemporary social issues. Applicants must have a minimum GPA of 3.7 and demonstrate financial need. Special consideration will be given to students who propose innovative solutions to challenges facing Hispanic communities in Illinois. International students are welcome to apply. Focus areas include academic excellence, community service, and innovation.",
        "gender": "Any",
        "gpa": 3.7,
        "hbcu": false,
        "international": true,
        "link": "https://www.example.edu/innovation-in-action-award",
        "location": "Illinois",
        "major": "History",
        "merit_based_aid": false,
        "need_based_aid": true,
        "race": [
            "Hispanic"
        ],
        "scholarship_name": "Innovation in Action Award"
    },
    {
        "amount": "10000.00",
        "classification": "Any",
        "deadline": "06/2025",
        "description": "The Modern Thinkers Scholarship supports female Native American students pursuing business degrees who demonstrate exceptional academic achievement and a commitment to innovative problem-solving. Applicants should possess a minimum GPA of 3.1 and exhibit leadership potential. Preference will be given to students involved in community service initiatives that address economic development or sustainability within Native American communities. Both merit and need are considered in the selection process.",
        "gender": "Female",
        "gpa": 3.1,
        "hbcu": true,
        "international": false,
        "link": "https://www.example.com/modern-thinkers-scholarship",
        "location": "Ohio",
        "major": "Business",
        "merit_based_aid": true,
        "need_based_aid": true,
        "race": [
            "Native American"
        ],
        "scholarship_name": "Modern Thinkers Scholarship"
    },
    {
        "amount": "10000.00",
        "classification": "Freshman",
        "deadline": "10/2025",
        "description": "The Emerging Leaders Award recognizes outstanding freshman students who demonstrate leadership potential and a commitment to impacting their communities through the arts. To be eligible, applicants must be incoming freshman students with a minimum GPA of 3.1 and pursuing a major within the Arts. International students are encouraged to apply. Preference will be given to students of Black, Native American, and Asian descent who exhibit exceptional artistic talent and a dedication to using their art to promote positive social change. This scholarship is not based on financial need or merit, but rather on the potential to become a future leader in the arts. Candidates should submit a portfolio showcasing their artistic work and a personal essay outlining their leadership experiences and aspirations.",
        "gender": "Any",
        "gpa": 3.1,
        "hbcu": false,
        "international": true,
        "link": "https://www.artsleadersfoundation.org/emerging-leaders-award",
        "location": "Pennsylvania",
        "major": "Arts",
        "merit_based_aid": false,
        "need_based_aid": false,
        "race": [
            "Black",
            "Native American",
            "Asian"
        ],
        "scholarship_name": "Emerging Leaders Award"
    },
    {
        "amount": "15000.00",
        "classification": "Freshman",
        "deadline": "10/2025",
        "description": "The Innovation in Action Award recognizes young male scholars who demonstrate exceptional creativity and a passion for using their artistic talents to address real-world problems. Applicants must be incoming freshmen, identify as male, have a minimum GPA of 2.6, and be of Black or African American descent. Special consideration will be given to students who can demonstrate how their artistic endeavors promote positive social change and community engagement. This scholarship prioritizes both academic merit and financial need.",
        "gender": "Male",
        "gpa": 2.6,
        "hbcu": true,
        "international": false,
        "link": "https://www.example.com/innovationinactionaward",
        "location": "Washington",
        "major": "Arts",
        "merit_based_aid": true,
        "need_based_aid": true,
        "race": [
            "Black"
        ],
        "scholarship_name": "Innovation in Action Award"
    },
    {
        "amount": "5000.00",
        "classification": "Sophomore",
        "deadline": "09/2025",
        "description": "The Next Gen Innovators Scholarship seeks to support exceptional sophomore students in Pennsylvania who demonstrate a passion for innovation and a commitment to making a positive impact on the world. Applicants should have a strong academic record (GPA of 3.6 or higher) and be actively involved in extracurricular activities. This scholarship is open to all genders and international students, with a particular interest in supporting Asian students who are pioneering new ideas in STEM, entrepreneurship, or the arts. Both merit-based and need-based aid are considered, with an emphasis on those who can articulate how their innovative pursuits will benefit their community and beyond. HBCU students are encouraged to apply.",
        "gender": "Any",
        "gpa": 3.6,
        "hbcu": true,
        "international": true,
        "link": "https://www.example.com/nextgeninnovators",
        "location": "Pennsylvania",
        "major": "",
        "merit_based_aid": true,
        "need_based_aid": true,
        "race": [
            "Asian"
        ],
        "scholarship_name": "Next Gen Innovators Scholarship"
    },
    {
        "amount": "7500.00",
        "classification": "Senior",
        "deadline": "06/2025",
        "description": "The Academic Excellence Award recognizes outstanding academic achievement and leadership potential in graduating high school seniors. Applicants must have a minimum GPA of 3.5 and demonstrate a strong passion for mathematics. This scholarship places special emphasis on innovation and problem-solving skills. Black and Asian male students pursuing a degree in Mathematics at a four-year university in New York are encouraged to apply. The award seeks to support future leaders in STEM fields.",
        "gender": "Male",
        "gpa": 3.5,
        "hbcu": true,
        "international": false,
        "link": "https://www.example.com/academicecellenceaward",
        "location": "New York",
        "major": "Mathematics",
        "merit_based_aid": true,
        "need_based_aid": false,
        "race": [
            "Black",
            "Asian"
        ],
        "scholarship_name": "Academic Excellence Award"
    },
    {
        "amount": "15000.00",
        "classification": "Junior",
        "deadline": "07/2025",
        "description": "The Next Gen Innovators Scholarship is awarded to outstanding junior-level students in Ohio pursuing degrees in Computer Science. Applicants should demonstrate academic excellence with a minimum GPA of 3.4, a passion for innovation, and a commitment to leveraging technology for positive societal impact. This merit-based scholarship recognizes students who are not only excelling in their studies but also actively contributing to the tech community through innovative projects, research, or entrepreneurial endeavors. Male students identifying as Other, Asian, or Hispanic are encouraged to apply.",
        "gender": "Male",
        "gpa": 3.4,
        "hbcu": true,
        "international": false,
        "link": "https://www.example.com/nextgeninnovators",
        "location": "Ohio",
        "major": "Computer Science",
        "merit_based_aid": true,
        "need_based_aid": false,
        "race": [
            "Other",
            "Asian",
            "Hispanic"
        ],
        "scholarship_name": "Next Gen Innovators Scholarship"
    },
    {
        "amount": "10000.00",
        "classification": "Senior",
        "deadline": "06/2025",
        "description": "The Green Future Award supports female-identifying students of Native American descent demonstrating academic excellence and a deep commitment to environmental sustainability. Applicants must have a minimum GPA of 3.7 and be pursuing studies related to environmental science, renewable energy, or sustainable agriculture. International students are welcome to apply. This scholarship prioritizes innovation in addressing climate change and improving the health of our planet for future generations. Need and merit are both considered.",
        "gender": "Female",
        "gpa": 3.7,
        "hbcu": false,
        "international": true,
        "link": "https://www.example.com/greenfutureaward",
        "location": "Massachusetts",
        "major": "",
        "merit_based_aid": true,
        "need_based_aid": true,
        "race": [
            "Native American"
        ],
        "scholarship_name": "Green Future Award"
    },
    {
        "amount": "5000.00",
        "classification": "Senior",
        "deadline": "07/2025",
        "description": "The Environmental Sustainability Award recognizes outstanding male senior students in Massachusetts who demonstrate a commitment to environmental stewardship through academic excellence and creative endeavors. Applicants must have a minimum GPA of 3.3 and be pursuing a major within the Arts. Special consideration will be given to students who have actively participated in community service initiatives focused on environmental conservation and who are of Black or Asian descent. This scholarship supports both merit and need-based aid. HBCU students are encouraged to apply.",
        "gender": "Male",
        "gpa": 3.3,
        "hbcu": true,
        "international": false,
        "link": "https://www.envirosustainaward.org/apply",
        "location": "Massachusetts",
        "major": "Arts",
        "merit_based_aid": true,
        "need_based_aid": true,
        "race": [
            "Black",
            "Asian"
        ],
        "scholarship_name": "Environmental Sustainability Award"
    },
    {
        "amount": "10000.00",
        "classification": "Junior",
        "deadline": "06/2025",
        "description": "The Entrepreneurial Spirit Grant is awarded to undergraduate students in Texas who demonstrate exceptional entrepreneurial spirit and innovation. Applicants must be currently enrolled as a junior in a Texas-based college or university with a minimum GPA of 3.8. This merit-based grant seeks to support future business leaders, innovators, and change-makers. Special consideration will be given to students who have launched their own ventures, participated in business plan competitions, or demonstrated leadership in entrepreneurial organizations. Black and Hispanic students are encouraged to apply. The grant is focused on supporting academic excellence and innovation.",
        "gender": "Any",
        "gpa": 3.8,
        "hbcu": true,
        "international": false,
        "link": "https://www.example.com/entrepreneurial-spirit-grant",
        "location": "Texas",
        "major": "",
        "merit_based_aid": true,
        "need_based_aid": false,
        "race": [
            "Black",
            "Hispanic"
        ],
        "scholarship_name": "Entrepreneurial Spirit Grant"
    },
    {
        "amount": "5000.00",
        "classification": "Sophomore",
        "deadline": "10/2025",
        "description": "The Entrepreneurial Spirit Grant seeks to support sophomore students in Arizona who demonstrate an interest in history and possess the drive to innovate and lead. Applicants must have a minimum GPA of 2.6 and identify as male. This grant focuses on students who exhibit creative problem-solving skills and are developing unique business ventures or initiatives, while also preserving historical stories. We encourage applicants from Native American, Hispanic, or other underrepresented backgrounds to apply and share how their heritage influences their entrepreneurial ideas.",
        "gender": "Male",
        "gpa": 2.6,
        "hbcu": false,
        "international": false,
        "link": "https://azhistoryinnovates.org/entrepreneurial-spirit-grant",
        "location": "Arizona",
        "major": "History",
        "merit_based_aid": false,
        "need_based_aid": false,
        "race": [
            "Native American",
            "Hispanic",
            "Other"
        ],
        "scholarship_name": "Entrepreneurial Spirit Grant"
    },
    {
        "amount": "10000.00",
        "classification": "Any",
        "deadline": "04/2025",
        "description": "The STEM Excellence Scholarship aims to support outstanding Computer Science students from underrepresented backgrounds. Eligibility requires a minimum GPA of 3.3 and demonstrated interest in contributing to the tech community. Special consideration will be given to students who have shown leadership in promoting diversity within STEM fields. Both need-based and merit-based aid considered. Open to domestic and international students attending school in Arizona. Black students are encouraged to apply.",
        "gender": "Any",
        "gpa": 3.3,
        "hbcu": true,
        "international": true,
        "link": "https://www.example.com/stemexcellencescholarship",
        "location": "Arizona",
        "major": "Computer Science",
        "merit_based_aid": true,
        "need_based_aid": true,
        "race": [
            "Black"
        ],
        "scholarship_name": "STEM Excellence Scholarship"
    },
    {
        "amount": "10000.00",
        "classification": "Any",
        "deadline": "04/2025",
        "description": "The Cultural Enrichment Award celebrates students who demonstrate a commitment to preserving and promoting their cultural heritage while excelling academically. This scholarship is open to History majors who identify as Asian or Hispanic, have a minimum GPA of 3.2, and are either U.S. citizens or international students studying in Pennsylvania. Special consideration will be given to applicants who actively participate in cultural organizations, community service initiatives, or artistic endeavors that showcase their cultural background. Need and merit are both considered.",
        "gender": "Male",
        "gpa": 3.2,
        "hbcu": false,
        "international": true,
        "link": "https://www.culturalenrichmentaward.org/apply",
        "location": "Pennsylvania",
        "major": "History",
        "merit_based_aid": true,
        "need_based_aid": true,
        "race": [
            "Asian",
            "Hispanic"
        ],
        "scholarship_name": "Cultural Enrichment Award"
    },
    {
        "amount": "15000.00",
        "classification": "Senior",
        "deadline": "04/2025",
        "description": "The Trailblazer Grant is awarded to exceptional female students of Hispanic or Asian descent pursuing a Biology major at a university in Georgia. Applicants must demonstrate a commitment to innovation within the biological sciences, academic excellence (minimum GPA of 3.1), and a passion for environmental sustainability. International students are encouraged to apply. This scholarship recognizes students who are not only academically gifted but also dedicated to paving new paths in their field. Both merit and need are considered.",
        "gender": "Female",
        "gpa": 3.1,
        "hbcu": false,
        "international": true,
        "link": "https://www.example.com/trailblazergrant",
        "location": "Georgia",
        "major": "Biology",
        "merit_based_aid": true,
        "need_based_aid": true,
        "race": [
            "Hispanic",
            "Asian"
        ],
        "scholarship_name": "Trailblazer Grant"
    },
    {
        "amount": "10000.00",
        "classification": "Sophomore",
        "deadline": "10/2025",
        "description": "The Creative Minds Grant supports sophomore male students in Illinois pursuing a History major who demonstrate financial need and a passion for historical research related to social justice. Applicants must have a minimum GPA of 2.7 and submit a 1500-word essay detailing their research proposal, focusing on underrepresented voices in history and its potential impact on contemporary society. Preference will be given to students actively involved in community service or organizations promoting equity and inclusion.",
        "gender": "Male",
        "gpa": 2.7,
        "hbcu": false,
        "international": false,
        "link": "https://www.creativemindsgrant.org/apply",
        "location": "Illinois",
        "major": "History",
        "merit_based_aid": false,
        "need_based_aid": true,
        "race": [
            "Other"
        ],
        "scholarship_name": "Creative Minds Grant"
    },
    {
        "amount": "7500.00",
        "classification": "Any",
        "deadline": "08/2025",
        "description": "The Modern Thinkers Scholarship supports innovative Computer Science students who demonstrate academic excellence and a commitment to using technology for positive social impact. Applicants must have a minimum GPA of 3.2 and be pursuing a degree in Computer Science at an accredited university. This scholarship welcomes international students and encourages applications from Asian and Hispanic students. Both merit and need are considered. Special consideration will be given to students developing AI solutions for environmental sustainability.",
        "gender": "Any",
        "gpa": 3.2,
        "hbcu": false,
        "international": true,
        "link": "https://www.example.com/modern-thinkers-scholarship",
        "location": "Georgia",
        "major": "Computer Science",
        "merit_based_aid": true,
        "need_based_aid": true,
        "race": [
            "Asian",
            "Hispanic"
        ],
        "scholarship_name": "Modern Thinkers Scholarship"
    },
    {
        "amount": "10000.00",
        "classification": "Freshman",
        "deadline": "05/2025",
        "description": "The Creative Minds Grant supports incoming freshman students pursuing Engineering degrees in Florida. Eligibility requires a minimum GPA of 3.4 and demonstrated financial need. International students are encouraged to apply. This grant specifically targets students with innovative ideas in sustainable engineering and a passion for solving real-world problems. Applicants must submit a detailed proposal outlining their innovative engineering project related to environmental sustainability. Students identifying as 'Other' race are especially encouraged to apply.",
        "gender": "Male",
        "gpa": 3.4,
        "hbcu": false,
        "international": true,
        "link": "https://www.exampleengineeringgrants.org/creativeminds",
        "location": "Florida",
        "major": "Engineering",
        "merit_based_aid": false,
        "need_based_aid": true,
        "race": [
            "Other"
        ],
        "scholarship_name": "Creative Minds Grant"
    },
    {
        "amount": "7500.00",
        "classification": "Junior",
        "deadline": "11/2025",
        "description": "The Impact Makers Scholarship seeks to support young men in Washington state who demonstrate a commitment to positive change within their communities. Applicants must be rising juniors with a minimum GPA of 2.7 and demonstrate significant financial need. This scholarship prioritizes those involved in community service initiatives, particularly those focused on environmental sustainability and addressing food insecurity. While academic excellence is considered, demonstrated action and a genuine desire to impact the lives of others is paramount. Special consideration will be given to applicants who have spearheaded their own initiatives or demonstrated exceptional leadership within existing organizations. To apply, submit a detailed essay outlining your community involvement, future goals, and financial need.",
        "gender": "Male",
        "gpa": 2.7,
        "hbcu": false,
        "international": false,
        "link": "https://www.impactmakerswa.org/scholarship-application",
        "location": "Washington",
        "major": "",
        "merit_based_aid": false,
        "need_based_aid": true,
        "race": [
            "Other"
        ],
        "scholarship_name": "Impact Makers Scholarship"
    },
    {
        "amount": "12500.00",
        "classification": "Freshman",
        "deadline": "04/2025",
        "description": "The Youth Leadership Award is granted to outstanding female freshman students in Texas pursuing a degree in Computer Science. Applicants must demonstrate academic excellence with a minimum GPA of 3.2, as well as a strong commitment to leadership and community service. Special consideration will be given to students who showcase innovative approaches to solving problems within their communities and have experience in coding or software development. Black, Asian, and students identifying as 'Other' race/ethnicity are encouraged to apply. Need-based and merit-based aid are both considered when selecting recipients. HBCU students are eligible and encouraged to apply.",
        "gender": "Female",
        "gpa": 3.2,
        "hbcu": true,
        "international": false,
        "link": "https://www.example.com/youthleadershipaward",
        "location": "Texas",
        "major": "Computer Science",
        "merit_based_aid": true,
        "need_based_aid": true,
        "race": [
            "Asian",
            "Other",
            "Black"
        ],
        "scholarship_name": "Youth Leadership Award"
    },
    {
        "amount": "5000.00",
        "classification": "Senior",
        "deadline": "09/2025",
        "description": "The Environmental Sustainability Award recognizes a graduating senior in Texas who has demonstrated a commitment to environmental stewardship through academic pursuits and community involvement. Applicants must have a minimum GPA of 2.9 and be pursuing studies related to environmental science, conservation, or a related field. While open to all students, preference will be given to Native American students who can demonstrate leadership in promoting sustainable practices within their communities. International students are encouraged to apply. This need-based scholarship supports students dedicated to creating a more sustainable future.",
        "gender": "Any",
        "gpa": 2.9,
        "hbcu": false,
        "international": true,
        "link": "https://www.enviroawards.org/texas-sustainability",
        "location": "Texas",
        "major": "",
        "merit_based_aid": false,
        "need_based_aid": true,
        "race": [
            "Native American"
        ],
        "scholarship_name": "Environmental Sustainability Award"
    },
    {
        "amount": "10000.00",
        "classification": "Senior",
        "deadline": "03/2025",
        "description": "The Pioneering Spirit Grant is awarded to female senior students of Native American descent in Illinois who demonstrate a commitment to academic excellence and artistic innovation. Applicants must have a minimum GPA of 3.2 and demonstrate financial need. International students are eligible. Special consideration will be given to applicants whose artistic endeavors reflect the preservation and evolution of Native American cultural heritage.",
        "gender": "Female",
        "gpa": 3.2,
        "hbcu": true,
        "international": true,
        "link": "https://www.example.edu/pioneering-spirit-grant",
        "location": "Illinois",
        "major": "Arts",
        "merit_based_aid": false,
        "need_based_aid": true,
        "race": [
            "Native American"
        ],
        "scholarship_name": "Pioneering Spirit Grant"
    },
    {
        "amount": "12500.00",
        "classification": "Any",
        "deadline": "04/2025",
        "description": "The Sustainable Growth Award supports male students pursuing degrees in the Arts who demonstrate a commitment to environmental sustainability through their creative work and community engagement. Applicants must have a minimum GPA of 2.9, demonstrate financial need, and be either of Hispanic or Black descent. International students are welcome to apply. Preference will be given to applicants whose artistic endeavors directly address issues of climate change, conservation, or environmental justice within their communities.",
        "gender": "Male",
        "gpa": 2.9,
        "hbcu": false,
        "international": true,
        "link": "https://www.sustainablegrowthaward.org/apply",
        "location": "Illinois",
        "major": "Arts",
        "merit_based_aid": false,
        "need_based_aid": true,
        "race": [
            "Hispanic",
            "Black"
        ],
        "scholarship_name": "Sustainable Growth Award"
    },
    {
        "amount": "10000.00",
        "classification": "Sophomore",
        "deadline": "08/2025",
        "description": "The Cultural Enrichment Award recognizes undergraduate students dedicated to promoting cultural understanding and diversity within their communities and academic pursuits. Applicants must be enrolled as a sophomore in a Georgia-based college or university, majoring in Computer Science, and maintain a minimum GPA of 2.7. This scholarship emphasizes academic excellence and demonstrated commitment to community service initiatives that foster cultural exchange and awareness. Special consideration will be given to applicants who showcase innovative approaches to bridging cultural gaps through technology.",
        "gender": "Any",
        "gpa": 2.7,
        "hbcu": false,
        "international": false,
        "link": "https://www.culturalenrichmentaward.org",
        "location": "Georgia",
        "major": "Computer Science",
        "merit_based_aid": true,
        "need_based_aid": true,
        "race": [
            "Asian",
            "Native American",
            "Black"
        ],
        "scholarship_name": "Cultural Enrichment Award"
    },
    {
        "amount": "7500.00",
        "classification": "Freshman",
        "deadline": "04/2025",
        "description": "The Excellence in Innovation Scholarship aims to support young, male innovators pursuing a degree in Business at a university in Texas. Applicants must have a minimum GPA of 3.1 and demonstrate a strong commitment to innovative thinking and problem-solving. While not mandatory, preference will be given to applicants of Asian, Native American, or other underrepresented racial backgrounds. HBCU students are encouraged to apply. This scholarship recognizes those who can articulate their unique approach to business challenges and their potential to create meaningful change.",
        "gender": "Male",
        "gpa": 3.1,
        "hbcu": true,
        "international": false,
        "link": "https://www.exampleinnovationscholars.org/apply",
        "location": "Texas",
        "major": "Business",
        "merit_based_aid": false,
        "need_based_aid": false,
        "race": [
            "Asian",
            "Other",
            "Native American"
        ],
        "scholarship_name": "Excellence in Innovation Scholarship"
    },
    {
        "amount": "7500.00",
        "classification": "Junior",
        "deadline": "12/2025",
        "description": "The Pioneering Spirit Grant supports female students of color pursuing Mathematics degrees who demonstrate financial need and a commitment to using their mathematical skills to address social issues. Applicants must have a minimum GPA of 3.4 and be international students. Preference will be given to students involved in community service initiatives focused on promoting STEM education in underserved communities and demonstrating innovative approaches to problem-solving.",
        "gender": "Female",
        "gpa": 3.4,
        "hbcu": false,
        "international": true,
        "link": "https://www.ohiomathematicsfoundation.org/pioneering-spirit-grant",
        "location": "Ohio",
        "major": "Mathematics",
        "merit_based_aid": false,
        "need_based_aid": true,
        "race": [
            "Black"
        ],
        "scholarship_name": "Pioneering Spirit Grant"
    },
    {
        "amount": "7500.00",
        "classification": "Sophomore",
        "deadline": "04/2025",
        "description": "The Breakthrough Innovators Scholarship supports students who demonstrate exceptional creativity and a passion for developing innovative solutions to real-world problems. Applicants must be sophomores with a minimum GPA of 2.5. This scholarship prioritizes students with backgrounds underrepresented in STEM fields, and we encourage applications from Native American, Hispanic, and other minority groups. The scholarship committee seeks individuals who can showcase their innovative projects, inventions, or research endeavors. While academic excellence is valued, the primary focus is on the applicant's potential to create impactful change through innovative thinking. HBCU students are strongly encouraged to apply. This scholarship is specifically for students attending schools located in New York.",
        "gender": "Any",
        "gpa": 2.5,
        "hbcu": true,
        "international": false,
        "link": "https://www.exampleinnovations.org/breakthrough-scholarship",
        "location": "New York",
        "major": "",
        "merit_based_aid": false,
        "need_based_aid": false,
        "race": [
            "Native American",
            "Other",
            "Hispanic"
        ],
        "scholarship_name": "Breakthrough Innovators Scholarship"
    },
    {
        "amount": "10000.00",
        "classification": "Any",
        "deadline": "08/2025",
        "description": "The Green Future Award supports outstanding female students of Native American descent pursuing a degree in History who demonstrate a commitment to environmental sustainability. Applicants must have a minimum GPA of 3.1 and demonstrate financial need. The scholarship prioritizes candidates involved in community service initiatives focused on preserving natural resources or promoting environmental awareness within their communities. Academic excellence, particularly in courses related to environmental history or policy, will also be considered. This award seeks to empower future leaders who will champion environmental stewardship and preserve our planet for generations to come.",
        "gender": "Female",
        "gpa": 3.1,
        "hbcu": false,
        "international": false,
        "link": "https://www.example.com/greenfutureaward",
        "location": "Michigan",
        "major": "History",
        "merit_based_aid": true,
        "need_based_aid": true,
        "race": [
            "Native American"
        ],
        "scholarship_name": "Green Future Award"
    },
    {
        "amount": "7500.00",
        "classification": "Sophomore",
        "deadline": "11/2025",
        "description": "The Humanitarian Impact Award recognizes sophomore female students from North Carolina majoring in Arts who demonstrate exceptional commitment to using their artistic talents to address social issues. Applicants should have a minimum GPA of 2.9 and demonstrate financial need. This scholarship prioritizes students who identify as Black and are passionate about international humanitarian work through arts, focusing on projects that promote cultural understanding and global citizenship. Both merit and need will be considered. International students are encouraged to apply.",
        "gender": "Female",
        "gpa": 2.9,
        "hbcu": false,
        "international": true,
        "link": "https://www.examplehumanitarianarts.org/apply",
        "location": "North Carolina",
        "major": "Arts",
        "merit_based_aid": true,
        "need_based_aid": true,
        "race": [
            "Black"
        ],
        "scholarship_name": "Humanitarian Impact Award"
    },
    {
        "amount": "15000.00",
        "classification": "Sophomore",
        "deadline": "05/2025",
        "description": "The Entrepreneurial Spirit Grant supports female students pursuing History degrees in Ohio who demonstrate innovative thinking and a commitment to using their historical knowledge to address contemporary challenges. Applicants must have a minimum GPA of 2.8 and identify as Asian. This grant prioritizes students with project ideas that blend historical research with entrepreneurial solutions, fostering community engagement and positive social impact. While not need or merit-based, strong consideration will be given to proposals that demonstrate a clear vision for a future venture.",
        "gender": "Female",
        "gpa": 2.8,
        "hbcu": true,
        "international": false,
        "link": "https://www.ohiocollegefoundation.org/entrepreneurialspiritgrant",
        "location": "Ohio",
        "major": "History",
        "merit_based_aid": false,
        "need_based_aid": false,
        "race": [
            "Asian"
        ],
        "scholarship_name": "Entrepreneurial Spirit Grant"
    },
    {
        "amount": "10000.00",
        "classification": "Sophomore",
        "deadline": "03/2025",
        "description": "The Community Service Grant is awarded to outstanding female sophomores in Washington state who demonstrate a strong commitment to community involvement and academic excellence. Applicants must have a minimum GPA of 2.7 and be majoring in Biology. This grant prioritizes students from underrepresented racial backgrounds (Black or Hispanic) and those who are international students. While not need or merit based, successful candidates will articulate how their passion for biology can be applied to solving community challenges, particularly in underserved communities. Applicants must provide documentation of at least 50 hours of community service within the past year. HBCU attendance is not a requirement, but encouraged.",
        "gender": "Female",
        "gpa": 2.7,
        "hbcu": true,
        "international": true,
        "link": "https://www.communityservicegrant.org/apply",
        "location": "Washington",
        "major": "Biology",
        "merit_based_aid": false,
        "need_based_aid": false,
        "race": [
            "Black",
            "Hispanic"
        ],
        "scholarship_name": "Community Service Grant"
    },
    {
        "amount": "15000.00",
        "classification": "Any",
        "deadline": "12/2025",
        "description": "The Social Impact Scholarship aims to support male students pursuing History degrees in Massachusetts who demonstrate a commitment to using historical knowledge to create positive social change. Applicants must maintain a GPA of 2.8 or higher and identify as Asian. While HBCU attendance is favored, it is not mandatory. The scholarship emphasizes academic excellence and leadership, recognizing students who actively engage with their communities and apply historical insights to contemporary issues. Special consideration will be given to those who demonstrate innovative approaches to historical preservation or education. This is a merit-based scholarship; financial need is not a primary consideration.",
        "gender": "Male",
        "gpa": 2.8,
        "hbcu": true,
        "international": false,
        "link": "https://www.socialimpactscholars.org/apply",
        "location": "Massachusetts",
        "major": "History",
        "merit_based_aid": true,
        "need_based_aid": false,
        "race": [
            "Asian"
        ],
        "scholarship_name": "Social Impact Scholarship"
    },
    {
        "amount": "15000.00",
        "classification": "Senior",
        "deadline": "07/2025",
        "description": "The Sustainable Growth Award recognizes outstanding senior students in Arizona who demonstrate a commitment to environmental sustainability and community leadership. Applicants must have a minimum GPA of 3.2 and be pursuing innovative solutions to environmental challenges. International students are welcome to apply. Preference will be given to students who identify as 'Other' and can demonstrate financial need in addition to academic merit. Projects focusing on renewable energy, conservation, or sustainable agriculture are especially encouraged.",
        "gender": "Any",
        "gpa": 3.2,
        "hbcu": false,
        "international": true,
        "link": "https://www.sustainablegrowthaward.org/apply",
        "location": "Arizona",
        "major": "",
        "merit_based_aid": true,
        "need_based_aid": true,
        "race": [
            "Other"
        ],
        "scholarship_name": "Sustainable Growth Award"
    },
    {
        "amount": "5000.00",
        "classification": "Freshman",
        "deadline": "05/2025",
        "description": "The Excellence in Design Scholarship recognizes female students pursuing Computer Science degrees in Florida who demonstrate academic excellence and a passion for innovative design. Applicants must have a minimum GPA of 2.6 and identify as Asian. This merit-based scholarship prioritizes students who showcase creativity and problem-solving skills through design projects. Submit a portfolio of your design work, highlighting your technical skills and artistic vision, along with your application.",
        "gender": "Female",
        "gpa": 2.6,
        "hbcu": true,
        "international": false,
        "link": "https://www.designexcellencefl.org/scholarships/apply",
        "location": "Florida",
        "major": "Computer Science",
        "merit_based_aid": true,
        "need_based_aid": false,
        "race": [
            "Asian"
        ],
        "scholarship_name": "Excellence in Design Scholarship"
    },
    {
        "amount": "12500.00",
        "classification": "Junior",
        "deadline": "06/2025",
        "description": "The Inspirational Achievement Grant is awarded to female-identifying junior students pursuing a degree in Mathematics. This need-based scholarship emphasizes academic excellence and community service. Applicants should demonstrate a commitment to using their mathematical skills to address social issues or contribute to their communities in meaningful ways. Special consideration will be given to applicants who have overcome personal challenges to pursue their educational goals and who are actively involved in promoting diversity and inclusion within STEM fields.",
        "gender": "Female",
        "gpa": 3.5,
        "hbcu": false,
        "international": true,
        "link": "https://www.example.com/inspirational-achievement-grant",
        "location": "Pennsylvania",
        "major": "Mathematics",
        "merit_based_aid": false,
        "need_based_aid": true,
        "race": [
            "Other"
        ],
        "scholarship_name": "Inspirational Achievement Grant"
    },
    {
        "amount": "12500.00",
        "classification": "Senior",
        "deadline": "12/2025",
        "description": "The Next Generation Leaders Grant supports outstanding Computer Science students in Georgia who demonstrate both academic excellence and a commitment to community service. Applicants must have a minimum GPA of 2.9 and demonstrate financial need. Special consideration will be given to students involved in innovative projects that leverage technology to address social or environmental challenges. HBCU students and students of Hispanic or other underrepresented racial backgrounds are strongly encouraged to apply.",
        "gender": "Any",
        "gpa": 2.9,
        "hbcu": true,
        "international": false,
        "link": "https://www.example.com/nextgenleadersgrant",
        "location": "Georgia",
        "major": "Computer Science",
        "merit_based_aid": false,
        "need_based_aid": true,
        "race": [
            "Other",
            "Hispanic"
        ],
        "scholarship_name": "Next Generation Leaders Grant"
    },
    {
        "amount": "15000.00",
        "classification": "Any",
        "deadline": "10/2025",
        "description": "The Community Leadership Scholarship supports female Engineering students of Asian descent in Illinois who demonstrate exceptional leadership potential and a commitment to serving their communities. Applicants must have a minimum GPA of 3.1 and demonstrate significant financial need. This scholarship prioritizes candidates involved in initiatives promoting environmental sustainability and/or innovation within their communities. International students are encouraged to apply.",
        "gender": "Female",
        "gpa": 3.1,
        "hbcu": false,
        "international": true,
        "link": "https://www.example.com/communityleadershipscholarship",
        "location": "Illinois",
        "major": "Engineering",
        "merit_based_aid": false,
        "need_based_aid": true,
        "race": [
            "Asian"
        ],
        "scholarship_name": "Community Leadership Scholarship"
    },
    {
        "amount": "12500.00",
        "classification": "Any",
        "deadline": "07/2025",
        "description": "The Breakthrough Innovators Scholarship supports male students pursuing a degree in History at an accredited Arizona university. Applicants must demonstrate a GPA of 2.8 or higher and a strong record of need-based aid eligibility. This scholarship specifically seeks individuals with innovative ideas and a passion for historical research that addresses contemporary social challenges. Black, Asian, and students identifying as 'Other' are encouraged to apply. Special consideration will be given to applicants attending Historically Black Colleges and Universities (HBCUs).",
        "gender": "Male",
        "gpa": 2.8,
        "hbcu": true,
        "international": false,
        "link": "https://www.example.com/breakthrough-innovators-scholarship",
        "location": "Arizona",
        "major": "History",
        "merit_based_aid": false,
        "need_based_aid": true,
        "race": [
            "Black",
            "Other",
            "Asian"
        ],
        "scholarship_name": "Breakthrough Innovators Scholarship"
    },
    {
        "amount": "7500.00",
        "classification": "Senior",
        "deadline": "03/2025",
        "description": "The Civic Engagement Award recognizes graduating female seniors in North Carolina who have demonstrated exceptional commitment to their communities through volunteer work, activism, or other forms of civic participation. Applicants should demonstrate a strong record of academic excellence, leadership, and a passion for addressing social issues. Special consideration will be given to applicants whose community work focuses on promoting equity and inclusion, environmental sustainability, or the arts.",
        "gender": "Female",
        "gpa": 3.0,
        "hbcu": true,
        "international": true,
        "link": "https://www.example.org/civic-engagement-award",
        "location": "North Carolina",
        "major": "Arts",
        "merit_based_aid": false,
        "need_based_aid": true,
        "race": [
            "Asian",
            "Other",
            "Hispanic"
        ],
        "scholarship_name": "Civic Engagement Award"
    },
    {
        "amount": "12500.00",
        "classification": "Sophomore",
        "deadline": "11/2025",
        "description": "The Modern Thinkers Scholarship is awarded to female sophomore students of Asian descent attending a college or university in North Carolina. Applicants should demonstrate academic excellence in Arts-related fields and possess a global perspective. International students are encouraged to apply. Special consideration will be given to applicants who demonstrate innovative thinking and creative problem-solving skills in their chosen field of study. A minimum GPA of 2.9 is required. Merit and need are not considered.",
        "gender": "Female",
        "gpa": 2.9,
        "hbcu": false,
        "international": true,
        "link": "https://www.modernthinkersscholarship.org",
        "location": "North Carolina",
        "major": "Arts",
        "merit_based_aid": false,
        "need_based_aid": false,
        "race": [
            "Asian"
        ],
        "scholarship_name": "Modern Thinkers Scholarship"
    },
    {
        "amount": "12500.00",
        "classification": "Freshman",
        "deadline": "06/2025",
        "description": "The Artistic Vision Award recognizes talented male freshman students of Native American descent pursuing studies in the arts. Applicants must demonstrate artistic excellence through a portfolio submission and maintain a minimum GPA of 3.1. This scholarship prioritizes innovation in artistic expression and aims to support students who are pushing boundaries and exploring new mediums within their chosen art form. International students are encouraged to apply.",
        "gender": "Male",
        "gpa": 3.1,
        "hbcu": true,
        "international": true,
        "link": "https://www.artisticvisionaward.org/apply",
        "location": "California",
        "major": "Arts",
        "merit_based_aid": false,
        "need_based_aid": false,
        "race": [
            "Native American"
        ],
        "scholarship_name": "Artistic Vision Award"
    },
    {
        "amount": "10000.00",
        "classification": "Any",
        "deadline": "09/2025",
        "description": "The Green Future Award supports Hispanic students pursuing engineering degrees who are passionate about environmental sustainability. Applicants must demonstrate academic excellence with a minimum GPA of 3.4 and articulate their commitment to creating a more sustainable future through innovative engineering solutions. Special consideration will be given to applicants involved in community projects focused on renewable energy or environmental conservation in Hispanic communities. This scholarship aims to foster leadership in environmental engineering and support the next generation of change-makers.",
        "gender": "Any",
        "gpa": 3.4,
        "hbcu": false,
        "international": true,
        "link": "https://www.example.com/greenfutureaward",
        "location": "New York",
        "major": "Engineering",
        "merit_based_aid": false,
        "need_based_aid": false,
        "race": [
            "Hispanic"
        ],
        "scholarship_name": "Green Future Award"
    },
    {
        "amount": "5000.00",
        "classification": "Freshman",
        "deadline": "07/2025",
        "description": "The Visionary Impact Award recognizes incoming freshmen demonstrating exceptional potential in Computer Science and a commitment to leveraging technology for social good. Applicants must have a minimum GPA of 3.1 and be pursuing a Computer Science major. This scholarship prioritizes international students who exhibit innovative thinking and a passion for creating technological solutions that address global challenges. Focus areas include academic excellence, innovation, and community impact through technology. Special consideration will be given to projects demonstrating the use of AI or machine learning for environmental sustainability or humanitarian aid.",
        "gender": "Male",
        "gpa": 3.1,
        "hbcu": false,
        "international": true,
        "link": "https://www.example.com/visionaryimpactaward",
        "location": "New York",
        "major": "Computer Science",
        "merit_based_aid": false,
        "need_based_aid": false,
        "race": [
            "Asian"
        ],
        "scholarship_name": "Visionary Impact Award"
    },
    {
        "amount": "5000.00",
        "classification": "Freshman",
        "deadline": "04/2025",
        "description": "The Next Gen Innovators Scholarship supports outstanding Hispanic freshman students pursuing Engineering degrees in Texas. Applicants must demonstrate academic excellence with a minimum GPA of 2.8 and a passion for innovation. This merit-based scholarship values community involvement and encourages students to develop groundbreaking solutions for pressing global challenges. International students are welcome to apply. Special consideration will be given to applicants who showcase their leadership skills and commitment to environmental sustainability.",
        "gender": "Any",
        "gpa": 2.8,
        "hbcu": true,
        "international": true,
        "link": "https://www.exampleengineeringinstitute.org/next-gen-innovators",
        "location": "Texas",
        "major": "Engineering",
        "merit_based_aid": true,
        "need_based_aid": false,
        "race": [
            "Hispanic"
        ],
        "scholarship_name": "Next Gen Innovators Scholarship"
    },
    {
        "amount": "10000.00",
        "classification": "Any",
        "deadline": "12/2025",
        "description": "The Impact Makers Scholarship seeks to empower future business leaders who demonstrate a commitment to both academic excellence and positive community impact. To be eligible, applicants must be pursuing a degree in Business at an accredited university in Illinois and maintain a minimum GPA of 2.7. We strongly encourage students of Asian, Hispanic, and Native American descent to apply. Special consideration will be given to students involved in innovative social entrepreneurship initiatives, showcasing leadership and a passion for sustainable business practices. This scholarship supports students who aspire to make a lasting difference in their communities through business.",
        "gender": "Any",
        "gpa": 2.7,
        "hbcu": true,
        "international": false,
        "link": "https://www.impactmakersfund.org/scholarships/apply",
        "location": "Illinois",
        "major": "Business",
        "merit_based_aid": false,
        "need_based_aid": false,
        "race": [
            "Asian",
            "Hispanic",
            "Native American"
        ],
        "scholarship_name": "Impact Makers Scholarship"
    },
    {
        "amount": "5000.00",
        "classification": "Sophomore",
        "deadline": "10/2025",
        "description": "The Pioneering Spirit Grant recognizes outstanding sophomore students in Michigan who demonstrate a commitment to innovation and leadership within their communities. Applicants must have a minimum GPA of 3.7 and identify as male. This grant specifically supports students of Native American or Black descent. International students are encouraged to apply. While not strictly need-based, preference will be given to applicants who can articulate how this grant will enable them to pursue unique projects or research endeavors that benefit their community or field of study. We strongly encourage applicants to showcase their creative problem-solving skills and forward-thinking ideas.",
        "gender": "Male",
        "gpa": 3.7,
        "hbcu": true,
        "international": true,
        "link": "https://www.example.com/pioneeringspiritgrant",
        "location": "Michigan",
        "major": "",
        "merit_based_aid": true,
        "need_based_aid": false,
        "race": [
            "Native American",
            "Black"
        ],
        "scholarship_name": "Pioneering Spirit Grant"
    },
    {
        "amount": "10000.00",
        "classification": "Senior",
        "deadline": "06/2025",
        "description": "The Emerging Leaders Award recognizes female-identifying senior students in Michigan pursuing Computer Science who demonstrate exceptional academic achievement, leadership qualities, and a commitment to innovation in technology. Applicants must have a minimum GPA of 2.8 and be actively involved in extracurricular activities related to STEM or community service. Special consideration will be given to candidates who have contributed to open-source projects or developed innovative solutions addressing societal challenges through technology.",
        "gender": "Female",
        "gpa": 2.8,
        "hbcu": false,
        "international": false,
        "link": "https://www.mitechscholarships.org/emerging-leaders-award",
        "location": "Michigan",
        "major": "Computer Science",
        "merit_based_aid": true,
        "need_based_aid": false,
        "race": [
            "Hispanic",
            "Asian",
            "Black"
        ],
        "scholarship_name": "Emerging Leaders Award"
    },
    {
        "amount": "15000.00",
        "classification": "Senior",
        "deadline": "08/2025",
        "description": "The Future Innovators Award recognizes outstanding male students in Illinois pursuing a degree in Business who demonstrate a commitment to innovation and leadership. Applicants must have a minimum GPA of 3.3 and identify as Black or another underrepresented race. Both merit and need will be considered in the selection process. International students attending Illinois universities are encouraged to apply. Special consideration will be given to applicants who have demonstrated entrepreneurial spirit or have a strong track record of community involvement. HBCU students are eligible and strongly encouraged to apply.",
        "gender": "Male",
        "gpa": 3.3,
        "hbcu": true,
        "international": true,
        "link": "https://www.example.com/futureinnovatorsaward",
        "location": "Illinois",
        "major": "Business",
        "merit_based_aid": true,
        "need_based_aid": true,
        "race": [
            "Black",
            "Other"
        ],
        "scholarship_name": "Future Innovators Award"
    },
    {
        "amount": "5000.00",
        "classification": "Junior",
        "deadline": "04/2025",
        "description": "The Inspirational Achievement Grant is awarded to outstanding junior-level Business majors residing in Washington state who demonstrate a strong commitment to both academic excellence and community service. Applicants must have a minimum GPA of 2.6 and showcase leadership qualities through extracurricular activities or volunteer work. Special consideration will be given to students who have overcome significant personal challenges to pursue their educational goals. We encourage students from diverse backgrounds to apply.",
        "gender": "Any",
        "gpa": 2.6,
        "hbcu": false,
        "international": false,
        "link": "https://www.example.com/inspirational-achievement-grant",
        "location": "Washington",
        "major": "Business",
        "merit_based_aid": true,
        "need_based_aid": true,
        "race": [
            "Black",
            "Hispanic",
            "Other"
        ],
        "scholarship_name": "Inspirational Achievement Grant"
    },
    {
        "amount": "15000.00",
        "classification": "Freshman",
        "deadline": "03/2025",
        "description": "The Social Impact Scholarship aims to support young men entering their freshman year of college in California who demonstrate a commitment to creating positive change in their communities. This scholarship prioritizes students with a strong academic record (minimum 2.7 GPA), combined with active involvement in community service initiatives and innovative projects addressing social or environmental challenges. Preference will be given to applicants from underrepresented racial backgrounds, specifically Native American, Hispanic, and Asian communities. International students are welcome to apply. Need-based aid is a key consideration, ensuring that financial constraints do not hinder deserving students from pursuing their educational goals and contributing to society. Candidates should articulate their vision for social impact and how their education will empower them to make a meaningful difference. This scholarship distinguishes itself by emphasizing the intersection of academic potential, community engagement, and innovative problem-solving.",
        "gender": "Male",
        "gpa": 2.7,
        "hbcu": true,
        "international": true,
        "link": "https://www.socialimpactscholars.org/apply",
        "location": "California",
        "major": "",
        "merit_based_aid": false,
        "need_based_aid": true,
        "race": [
            "Native American",
            "Hispanic",
            "Asian"
        ],
        "scholarship_name": "Social Impact Scholarship"
    },
    {
        "amount": "15000.00",
        "classification": "Freshman",
        "deadline": "05/2025",
        "description": "The Inspirational Achievement Grant is designed to empower young men from underrepresented backgrounds to pursue their academic and professional dreams in Business. To be eligible, applicants must be incoming freshman males with a minimum GPA of 2.5. This need-based scholarship recognizes individuals who demonstrate not only academic potential but also a commitment to leadership and community service. Special consideration will be given to applicants who have overcome significant personal challenges or demonstrated innovation in their approach to problem-solving. Students with Hispanic, Native American, or other diverse racial backgrounds are encouraged to apply and HBCU students are eligible.",
        "gender": "Male",
        "gpa": 2.5,
        "hbcu": true,
        "international": false,
        "link": "https://www.example.com/inspirationalachievementgrant",
        "location": "Washington",
        "major": "Business",
        "merit_based_aid": false,
        "need_based_aid": true,
        "race": [
            "Hispanic",
            "Other",
            "Native American"
        ],
        "scholarship_name": "Inspirational Achievement Grant"
    },
    {
        "amount": "5000.00",
        "classification": "Freshman",
        "deadline": "04/2025",
        "description": "The Future Leaders Scholarship is designed to support outstanding male students pursuing a Biology major at a university in North Carolina. To be eligible, applicants must have a minimum GPA of 2.6 and demonstrate financial need. This scholarship focuses on recognizing students who exhibit leadership potential and a commitment to community service. Special consideration will be given to applicants who have been involved in environmental sustainability initiatives or have shown innovation in their approach to scientific problem-solving. This scholarship seeks to nurture the next generation of male leaders in Biology, particularly those from underrepresented racial or ethnic backgrounds.",
        "gender": "Male",
        "gpa": 2.6,
        "hbcu": true,
        "international": false,
        "link": "https://www.example.com/futureleadersscholarship",
        "location": "North Carolina",
        "major": "Biology",
        "merit_based_aid": false,
        "need_based_aid": true,
        "race": [
            "Hispanic",
            "Asian",
            "Native American"
        ],
        "scholarship_name": "Future Leaders Scholarship"
    },
    {
        "amount": "10000.00",
        "classification": "Freshman",
        "deadline": "06/2025",
        "description": "The Pioneering Spirit Grant is awarded to female students from Ohio pursuing a Computer Science major. Applicants must demonstrate academic excellence with a minimum GPA of 2.7, a commitment to innovation through prior project work, and a spirit of leadership within their community. Special consideration will be given to students of Hispanic or other underrepresented backgrounds, especially those who have overcome adversity to pursue their academic goals. Both merit and need are considered.",
        "gender": "Female",
        "gpa": 2.7,
        "hbcu": true,
        "international": false,
        "link": "https://www.ohiocomputerscience.org/pioneering-spirit-grant",
        "location": "Ohio",
        "major": "Computer Science",
        "merit_based_aid": true,
        "need_based_aid": true,
        "race": [
            "Hispanic",
            "Other"
        ],
        "scholarship_name": "Pioneering Spirit Grant"
    },
    {
        "amount": "7500.00",
        "classification": "Senior",
        "deadline": "10/2025",
        "description": "The Social Impact Scholarship supports outstanding senior students in Texas pursuing a Business major who demonstrate a commitment to creating positive change in their communities. Applicants must have a minimum GPA of 2.8 and identify as male. This scholarship prioritizes students who are driving social innovation, either through entrepreneurial ventures or impactful community initiatives. While not need or merit based, successful candidates will articulate a clear vision for leveraging their business acumen to address pressing social issues. Open to both domestic and international students, with special consideration given to students from underrepresented racial backgrounds, including Asian and other minority groups. HBCU students are encouraged to apply.",
        "gender": "Male",
        "gpa": 2.8,
        "hbcu": true,
        "international": true,
        "link": "https://www.example.com/socialimpactscholarship",
        "location": "Texas",
        "major": "Business",
        "merit_based_aid": false,
        "need_based_aid": false,
        "race": [
            "Other",
            "Asian"
        ],
        "scholarship_name": "Social Impact Scholarship"
    },
    {
        "amount": "12500.00",
        "classification": "Sophomore",
        "deadline": "04/2025",
        "description": "The Artistic Vision Award supports sophomore students residing in Arizona who demonstrate exceptional artistic talent and a commitment to using their art for positive community impact. Applicants should submit a portfolio of their work showcasing creativity and technical skill, along with an essay outlining their artistic vision and how they plan to contribute to their community through art. Special consideration will be given to applicants whose work explores themes of cultural identity and social justice.",
        "gender": "Any",
        "gpa": 3.3,
        "hbcu": false,
        "international": false,
        "link": "https://www.azartcouncil.org/artisticvisionaward",
        "location": "Arizona",
        "major": "",
        "merit_based_aid": false,
        "need_based_aid": false,
        "race": [
            "Native American",
            "Hispanic",
            "Black"
        ],
        "scholarship_name": "Artistic Vision Award"
    },
    {
        "amount": "10000.00",
        "classification": "Sophomore",
        "deadline": "03/2025",
        "description": "The Humanitarian Impact Award recognizes undergraduate Engineering students at Michigan universities who demonstrate a commitment to using their engineering skills to address pressing global challenges. Applicants should have a minimum GPA of 3.0 and be able to showcase significant involvement in projects related to sustainable development, disaster relief, or improving quality of life for underserved communities. Special consideration will be given to projects that demonstrate innovation and scalability. This scholarship prioritizes students with demonstrated financial need.",
        "gender": "Any",
        "gpa": 3.0,
        "hbcu": false,
        "international": false,
        "link": "https://www.humanitarianimpactaward.org/apply",
        "location": "Michigan",
        "major": "Engineering",
        "merit_based_aid": false,
        "need_based_aid": true,
        "race": [
            "Other",
            "Asian",
            "Hispanic"
        ],
        "scholarship_name": "Humanitarian Impact Award"
    },
    {
        "amount": "12500.00",
        "classification": "Freshman",
        "deadline": "08/2025",
        "description": "The Next Gen Innovators Scholarship supports ambitious male students entering their freshman year of college who demonstrate exceptional potential in innovation and leadership. Applicants must have a minimum GPA of 3.6 and be residents of Michigan. This scholarship is open to both domestic and international students. We strongly encourage students of Native American, Hispanic, or other underrepresented racial backgrounds to apply. While not mandatory, preference will be given to students who showcase a passion for utilizing technology or entrepreneurship to address pressing environmental issues or contribute to community development. Both merit and need will be considered. Recipients will also be invited to participate in a mentorship program with industry leaders.",
        "gender": "Male",
        "gpa": 3.6,
        "hbcu": true,
        "international": true,
        "link": "https://www.example.com/nextgeninnovators",
        "location": "Michigan",
        "major": "",
        "merit_based_aid": true,
        "need_based_aid": true,
        "race": [
            "Native American",
            "Hispanic",
            "Other"
        ],
        "scholarship_name": "Next Gen Innovators Scholarship"
    },
    {
        "amount": "10000.00",
        "classification": "Senior",
        "deadline": "06/2025",
        "description": "The Green Future Award supports outstanding male seniors in Florida pursuing studies related to environmental sustainability. Applicants must demonstrate academic excellence with a minimum GPA of 3.3 and a commitment to environmental protection through community service or innovative projects. Black, Hispanic, and Native American students are encouraged to apply. This scholarship prioritizes need-based aid and is open to international students passionate about creating a greener future.",
        "gender": "Male",
        "gpa": 3.3,
        "hbcu": true,
        "international": true,
        "link": "https://www.enviroawardsfl.org/greenfuture",
        "location": "Florida",
        "major": "Arts",
        "merit_based_aid": false,
        "need_based_aid": true,
        "race": [
            "Black",
            "Hispanic",
            "Native American"
        ],
        "scholarship_name": "Green Future Award"
    },
    {
        "amount": "15000.00",
        "classification": "Freshman",
        "deadline": "10/2025",
        "description": "The Environmental Sustainability Award recognizes outstanding high school seniors who demonstrate a commitment to environmental stewardship and academic excellence. Applicants must have a minimum GPA of 3.7 and plan to major in Biology or a related field. This scholarship prioritizes students who have actively participated in environmental conservation projects, showcasing leadership and innovation in addressing environmental challenges. Black and Hispanic male students residing in Massachusetts and demonstrate financial need will be given special consideration. International students are also eligible to apply.",
        "gender": "Male",
        "gpa": 3.7,
        "hbcu": true,
        "international": true,
        "link": "https://www.environsustain.org/scholarships/apply",
        "location": "Massachusetts",
        "major": "Biology",
        "merit_based_aid": false,
        "need_based_aid": false,
        "race": [
            "Black",
            "Hispanic"
        ],
        "scholarship_name": "Environmental Sustainability Award"
    },
    {
        "amount": "12500.00",
        "classification": "Any",
        "deadline": "06/2025",
        "description": "The Academic Excellence Award recognizes outstanding Computer Science students in Pennsylvania who demonstrate a commitment to innovation and academic rigor. Applicants must maintain a minimum GPA of 2.9 and identify as Asian. The scholarship prioritizes students involved in community service initiatives related to technology education and mentorship. This award stands out by offering recipients access to a summer internship at a leading tech company in Pittsburgh.",
        "gender": "Any",
        "gpa": 2.9,
        "hbcu": true,
        "international": false,
        "link": "https://example.com/academic-excellence-award",
        "location": "Pennsylvania",
        "major": "Computer Science",
        "merit_based_aid": true,
        "need_based_aid": false,
        "race": [
            "Asian"
        ],
        "scholarship_name": "Academic Excellence Award"
    },
    {
        "amount": "12500.00",
        "classification": "Sophomore",
        "deadline": "11/2025",
        "description": "The Youth Leadership Award recognizes young men demonstrating exceptional leadership potential and a commitment to their communities. Applicants must be male sophomores residing in Pennsylvania, pursuing a major in Mathematics with a minimum GPA of 2.7. This scholarship prioritizes individuals actively involved in community service initiatives focused on promoting STEM education in underserved areas. Special consideration will be given to candidates who showcase innovative problem-solving skills and a passion for mentoring younger students in mathematics. While academic excellence is important, demonstrated leadership and community impact are paramount. Black and Asian male students are strongly encouraged to apply.",
        "gender": "Male",
        "gpa": 2.7,
        "hbcu": false,
        "international": false,
        "link": "https://www.example.com/youthleadershipaward",
        "location": "Pennsylvania",
        "major": "Mathematics",
        "merit_based_aid": false,
        "need_based_aid": false,
        "race": [
            "Black",
            "Asian"
        ],
        "scholarship_name": "Youth Leadership Award"
    },
    {
        "amount": "7500.00",
        "classification": "Any",
        "deadline": "07/2025",
        "description": "The Community Service Grant supports students with a demonstrated commitment to volunteerism and civic engagement in the Ohio region. Applicants must have a minimum GPA of 3.6 and be pursuing a degree in History. While not strictly merit-based, academic performance is considered alongside the depth and impact of community service. Need-based aid is a primary consideration. Special consideration will be given to applicants involved in preserving local historical landmarks or engaging in projects that directly benefit underserved communities. Native American and Other races are encouraged to apply. Open to international students. This grant is distinct in its emphasis on practical application of historical knowledge in service to the community.",
        "gender": "Any",
        "gpa": 3.6,
        "hbcu": true,
        "international": true,
        "link": "https://www.ohio-community-foundation.org/service-grant",
        "location": "Ohio",
        "major": "History",
        "merit_based_aid": false,
        "need_based_aid": true,
        "race": [
            "Other",
            "Native American"
        ],
        "scholarship_name": "Community Service Grant"
    },
    {
        "amount": "12500.00",
        "classification": "Freshman",
        "deadline": "06/2025",
        "description": "The Next Gen Innovators Scholarship supports creative and driven incoming freshmen at Ohio universities who demonstrate a passion for the arts and a commitment to pushing boundaries. Applicants should showcase academic excellence (minimum 3.5 GPA), innovative thinking, and a desire to use their artistic talents to make a positive impact. Special consideration will be given to students with experience in community arts projects. This scholarship encourages Native American students and students of other racial backgrounds to apply. International students are also eligible.",
        "gender": "Any",
        "gpa": 3.5,
        "hbcu": true,
        "international": true,
        "link": "https://www.exampleartsfoundation.org/next-gen-innovators",
        "location": "Ohio",
        "major": "Arts",
        "merit_based_aid": false,
        "need_based_aid": false,
        "race": [
            "Native American",
            "Other"
        ],
        "scholarship_name": "Next Gen Innovators Scholarship"
    },
    {
        "amount": "12500.00",
        "classification": "Any",
        "deadline": "04/2025",
        "description": "The Global Vision Award recognizes male students pursuing Engineering degrees who demonstrate a commitment to innovative solutions for global challenges. Applicants must maintain a GPA of 3.2 or higher and be international students currently studying in Massachusetts. While not need or merit based, preference will be given to applicants from Asian or Native American backgrounds who exhibit strong leadership potential and a passion for environmental sustainability through engineering. Special consideration will be given to projects demonstrating ingenuity in renewable energy or sustainable infrastructure development.",
        "gender": "Male",
        "gpa": 3.2,
        "hbcu": false,
        "international": true,
        "link": "https://www.exampleengineeringawards.org/globalvision",
        "location": "Massachusetts",
        "major": "Engineering",
        "merit_based_aid": false,
        "need_based_aid": false,
        "race": [
            "Asian",
            "Native American"
        ],
        "scholarship_name": "Global Vision Award"
    },
    {
        "amount": "10000.00",
        "classification": "Junior",
        "deadline": "10/2025",
        "description": "The Technology Leadership Award recognizes female junior students pursuing engineering degrees who demonstrate exceptional leadership potential and a commitment to innovation. Applicants must maintain a minimum GPA of 3.4 and demonstrate financial need. This scholarship specifically supports students from Hispanic and Asian backgrounds who are also international students, encouraging them to become future leaders in the tech industry. Special consideration will be given to candidates involved in community service initiatives promoting STEM education.",
        "gender": "Female",
        "gpa": 3.4,
        "hbcu": false,
        "international": true,
        "link": "https://www.example.com/techleadershipaward",
        "location": "Washington",
        "major": "Engineering",
        "merit_based_aid": false,
        "need_based_aid": true,
        "race": [
            "Hispanic",
            "Asian"
        ],
        "scholarship_name": "Technology Leadership Award"
    },
    {
        "amount": "5000.00",
        "classification": "Any",
        "deadline": "11/2025",
        "description": "The Community Leadership Scholarship supports students in North Carolina who demonstrate exceptional leadership skills and a commitment to serving their communities. Applicants should have a GPA of 3.1 or higher and be pursuing a degree in Computer Science. While not strictly merit-based, academic excellence is considered alongside leadership contributions. Need-based aid is a significant factor in the selection process. This scholarship particularly encourages applications from students of Asian, Black, and other underrepresented racial backgrounds who are actively involved in community initiatives. Bonus points for projects addressing local tech access disparities. HBCU students are encouraged to apply.",
        "gender": "Any",
        "gpa": 3.1,
        "hbcu": true,
        "international": false,
        "link": "https://www.example.com/communityleadershipscholarship",
        "location": "North Carolina",
        "major": "Computer Science",
        "merit_based_aid": false,
        "need_based_aid": true,
        "race": [
            "Other",
            "Asian",
            "Black"
        ],
        "scholarship_name": "Community Leadership Scholarship"
    },
    {
        "amount": "12500.00",
        "classification": "Junior",
        "deadline": "12/2025",
        "description": "The Science and Innovation Scholarship supports outstanding junior students pursuing degrees related to History who demonstrate a commitment to applying historical knowledge to solve contemporary challenges in science and technology. Applicants must have a minimum GPA of 3.0 and demonstrate leadership qualities through extracurricular activities or community involvement. International students are encouraged to apply. Special consideration will be given to students who showcase innovative approaches to historical research and its application to modern-day scientific advancements.",
        "gender": "Any",
        "gpa": 3.0,
        "hbcu": false,
        "international": true,
        "link": "https://www.example.com/science-innovation-scholarship",
        "location": "North Carolina",
        "major": "History",
        "merit_based_aid": true,
        "need_based_aid": false,
        "race": [
            "Asian"
        ],
        "scholarship_name": "Science and Innovation Scholarship"
    },
    {
        "amount": "15000.00",
        "classification": "Senior",
        "deadline": "10/2025",
        "description": "The Emerging Leaders Award recognizes outstanding female senior students in Massachusetts pursuing a Business major who demonstrate exceptional leadership potential and a commitment to innovation. Applicants must maintain a minimum GPA of 3.2 and be enrolled in an accredited university or college within Massachusetts. International students are encouraged to apply. Preference will be given to students of Native American descent who have shown a dedication to community service and possess innovative ideas for sustainable business practices. This scholarship takes both merit and financial need into consideration to support the next generation of female business leaders.",
        "gender": "Female",
        "gpa": 3.2,
        "hbcu": false,
        "international": true,
        "link": "https://www.example.com/emergingleadersaward",
        "location": "Massachusetts",
        "major": "Business",
        "merit_based_aid": true,
        "need_based_aid": true,
        "race": [
            "Native American"
        ],
        "scholarship_name": "Emerging Leaders Award"
    },
    {
        "amount": "15000.00",
        "classification": "Freshman",
        "deadline": "12/2025",
        "description": "The Artistic Vision Award celebrates and supports emerging male artists in Texas. Open to incoming freshmen pursuing any major, this scholarship prioritizes applicants with a strong portfolio demonstrating exceptional artistic talent and a clear vision for their creative future. Academic excellence is considered, but the primary focus is on artistic merit, innovation, and the potential to contribute to the vibrant arts community of Texas. Applicants must submit a portfolio of their work and an essay outlining their artistic goals and how the scholarship will help them achieve those goals. Special consideration will be given to applicants whose work reflects their cultural heritage and promotes cross-cultural understanding.",
        "gender": "Male",
        "gpa": 3.3,
        "hbcu": false,
        "international": false,
        "link": "https://www.texasartsfoundation.org/artisticvisionaward",
        "location": "Texas",
        "major": "",
        "merit_based_aid": true,
        "need_based_aid": false,
        "race": [
            "Hispanic",
            "Native American",
            "Asian"
        ],
        "scholarship_name": "Artistic Vision Award"
    },
    {
        "amount": "15000.00",
        "classification": "Senior",
        "deadline": "04/2025",
        "description": "The Sustainable Growth Award recognizes outstanding History students who demonstrate a commitment to environmental sustainability through their academic work and extracurricular activities. Applicants must have a minimum GPA of 3.6 and be passionate about exploring the historical context of environmental challenges and solutions. Special consideration will be given to students involved in community initiatives focused on conservation, renewable energy, or sustainable agriculture. International students are encouraged to apply.",
        "gender": "Any",
        "gpa": 3.6,
        "hbcu": false,
        "international": true,
        "link": "https://www.azfoundation.org/sustainablegrowthaward",
        "location": "Arizona",
        "major": "History",
        "merit_based_aid": true,
        "need_based_aid": true,
        "race": [
            "Hispanic",
            "Native American",
            "Asian"
        ],
        "scholarship_name": "Sustainable Growth Award"
    },
    {
        "amount": "12500.00",
        "classification": "Senior",
        "deadline": "04/2025",
        "description": "The Diversity and Inclusion Scholarship aims to support outstanding senior students in Georgia who demonstrate a commitment to fostering inclusive communities and promoting diversity in their chosen fields. Applicants should possess a minimum GPA of 2.9 and identify as Black or another underrepresented race. This merit-based scholarship recognizes academic excellence, leadership qualities, and active involvement in community service initiatives that champion diversity and inclusion. Special consideration will be given to candidates who have demonstrated leadership in promoting cross-cultural understanding or have overcome significant challenges to pursue their educational goals. HBCU students are strongly encouraged to apply. This scholarship is designed to empower future leaders who will shape a more equitable and inclusive world.",
        "gender": "Any",
        "gpa": 2.9,
        "hbcu": true,
        "international": false,
        "link": "https://www.example.com/diversity-inclusion-scholarship",
        "location": "Georgia",
        "major": "",
        "merit_based_aid": true,
        "need_based_aid": false,
        "race": [
            "Black",
            "Other"
        ],
        "scholarship_name": "Diversity and Inclusion Scholarship"
    },
    {
        "amount": "7500.00",
        "classification": "Sophomore",
        "deadline": "03/2025",
        "description": "The Arts Excellence Grant is awarded to female sophomore students in Florida who demonstrate exceptional talent and commitment to the arts, coupled with strong academic performance. Applicants must have a minimum GPA of 3.1 and be majoring in Biology, showcasing an interest in the intersection of art and science. Preference will be given to students of Hispanic, Native American, or Asian descent. This grant recognizes not only academic excellence but also artistic innovation and community engagement through artistic expression. Need and merit are both considered.",
        "gender": "Female",
        "gpa": 3.1,
        "hbcu": true,
        "international": false,
        "link": "https://www.artsflorida.org/excellence-grant",
        "location": "Florida",
        "major": "Biology",
        "merit_based_aid": true,
        "need_based_aid": true,
        "race": [
            "Hispanic",
            "Native American",
            "Asian"
        ],
        "scholarship_name": "Arts Excellence Grant"
    },
    {
        "amount": "7500.00",
        "classification": "Senior",
        "deadline": "11/2025",
        "description": "The Academic Excellence Award recognizes female-identifying senior students pursuing a Biology major who have demonstrated exceptional academic achievement and a commitment to community service. Applicants must maintain a minimum GPA of 3.8. Special consideration will be given to students involved in environmental sustainability initiatives and/or demonstrate leadership in STEM-related extracurricular activities. This award aims to support underrepresented groups in STEM.",
        "gender": "Female",
        "gpa": 3.8,
        "hbcu": false,
        "international": false,
        "link": "https://www.example.com/academicecellenceaward",
        "location": "New York",
        "major": "Biology",
        "merit_based_aid": true,
        "need_based_aid": true,
        "race": [
            "Asian",
            "Hispanic",
            "Black"
        ],
        "scholarship_name": "Academic Excellence Award"
    },
    {
        "amount": "5000.00",
        "classification": "Freshman",
        "deadline": "09/2025",
        "description": "The Modern Thinkers Scholarship supports promising female students pursuing Mathematics degrees in Massachusetts. Applicants should demonstrate academic excellence (minimum 3.6 GPA), a passion for innovative problem-solving, and a commitment to using their mathematical skills for the betterment of their communities. Special consideration will be given to students of Hispanic or Native American descent who demonstrate financial need. Strong candidates will showcase their leadership potential through extracurricular activities or community involvement. This scholarship aims to empower the next generation of female mathematicians to become leaders and innovators.",
        "gender": "Female",
        "gpa": 3.6,
        "hbcu": true,
        "international": false,
        "link": "https://www.example.com/modernthinkersscholarship",
        "location": "Massachusetts",
        "major": "Mathematics",
        "merit_based_aid": true,
        "need_based_aid": true,
        "race": [
            "Hispanic",
            "Native American"
        ],
        "scholarship_name": "Modern Thinkers Scholarship"
    },
    {
        "amount": "12500.00",
        "classification": "Freshman",
        "deadline": "07/2025",
        "description": "The Sustainable Growth Award supports female freshman students of Native American descent pursuing Arts degrees in California. Applicants must demonstrate a commitment to environmental sustainability through community service or artistic expression. A minimum GPA of 3.7 is required, and preference will be given to students with demonstrated financial need. This scholarship aims to empower young women to become leaders in integrating artistic vision with sustainable practices.",
        "gender": "Female",
        "gpa": 3.7,
        "hbcu": true,
        "international": false,
        "link": "https://www.sustainablegrowthfoundation.org/apply",
        "location": "California",
        "major": "Arts",
        "merit_based_aid": false,
        "need_based_aid": true,
        "race": [
            "Native American"
        ],
        "scholarship_name": "Sustainable Growth Award"
    },
    {
        "amount": "5000.00",
        "classification": "Freshman",
        "deadline": "04/2025",
        "description": "The Creative Minds Grant supports incoming freshman students at Pennsylvania universities who demonstrate exceptional talent and passion in mathematics. Applicants must have a minimum GPA of 3.8 and be pursuing a degree in mathematics. This scholarship emphasizes innovative problem-solving and creative applications of mathematical principles. International students are welcome to apply. While need-based aid is considered, merit is the primary factor. Black students are particularly encouraged to apply. The selection committee will review applicant essays detailing their most creative mathematical project and its impact.",
        "gender": "Any",
        "gpa": 3.8,
        "hbcu": false,
        "international": true,
        "link": "https://www.example.edu/creativemindsgrant",
        "location": "Pennsylvania",
        "major": "Mathematics",
        "merit_based_aid": true,
        "need_based_aid": true,
        "race": [
            "Black"
        ],
        "scholarship_name": "Creative Minds Grant"
    },
    {
        "amount": "10000.00",
        "classification": "Freshman",
        "deadline": "12/2025",
        "description": "The Community Service Grant recognizes outstanding female freshman students pursuing Computer Science in Georgia who demonstrate a commitment to using technology for social good. Applicants must maintain a minimum GPA of 3.8 and identify as either Native American or Asian. While not need-based, preference is given to students who showcase innovative solutions to community problems through coding or technological applications. International students are welcome to apply. This grant emphasizes using technical skills to create positive change within local and global communities. This initiative supports women in STEM, leadership, and community engagement. The goal is to help students realize their potential to improve the world.",
        "gender": "Female",
        "gpa": 3.8,
        "hbcu": false,
        "international": true,
        "link": "https://www.examplecommunityservicegrant.org/apply",
        "location": "Georgia",
        "major": "Computer Science",
        "merit_based_aid": true,
        "need_based_aid": true,
        "race": [
            "Native American",
            "Asian"
        ],
        "scholarship_name": "Community Service Grant"
    },
    {
        "amount": "15000.00",
        "classification": "Junior",
        "deadline": "11/2025",
        "description": "The Community Leadership Scholarship is awarded to outstanding junior-level students pursuing a degree in Computer Science at a university in Ohio. Applicants must demonstrate a strong commitment to community service and academic excellence, maintaining a minimum GPA of 3.3. This scholarship is open to all genders and welcomes international students. Special consideration will be given to students who have initiated or actively participated in projects promoting innovation and environmental sustainability within their communities. While not exclusively for these groups, we strongly encourage applications from Native American, Asian, and students identifying as 'Other' races.",
        "gender": "Any",
        "gpa": 3.3,
        "hbcu": false,
        "international": true,
        "link": "https://www.example.com/communityleadershipscholarship",
        "location": "Ohio",
        "major": "Computer Science",
        "merit_based_aid": true,
        "need_based_aid": true,
        "race": [
            "Native American",
            "Asian",
            "Other"
        ],
        "scholarship_name": "Community Leadership Scholarship"
    },
    {
        "amount": "12500.00",
        "classification": "Senior",
        "deadline": "03/2025",
        "description": "The Pioneering Spirit Grant supports female students of Asian descent pursuing a Biology degree in Washington state. Applicants must demonstrate financial need and maintain a minimum GPA of 2.9. This scholarship prioritizes candidates involved in innovative research or projects related to environmental sustainability and conservation. Special consideration will be given to applicants who showcase leadership skills through community service or extracurricular activities.",
        "gender": "Female",
        "gpa": 2.9,
        "hbcu": false,
        "international": true,
        "link": "https://www.example.com/pioneeringspiritgrant",
        "location": "Washington",
        "major": "Biology",
        "merit_based_aid": false,
        "need_based_aid": true,
        "race": [
            "Asian"
        ],
        "scholarship_name": "Pioneering Spirit Grant"
    },
    {
        "amount": "15000.00",
        "classification": "Freshman",
        "deadline": "05/2025",
        "description": "The Science and Innovation Scholarship recognizes exceptional incoming freshman students pursuing Mathematics at a Pennsylvania-based institution who demonstrate a passion for innovation and academic excellence. Applicants should exhibit a strong aptitude for mathematical concepts and a desire to apply their knowledge to solve real-world problems. A minimum GPA of 3.1 is required. International students are welcome to apply. This scholarship places particular emphasis on students involved in community service initiatives that promote STEM education or address environmental sustainability, and especially encourages applications from Black students. Both merit and need are considered.",
        "gender": "Any",
        "gpa": 3.1,
        "hbcu": false,
        "international": true,
        "link": "https://www.example.com/science-innovation-scholarship",
        "location": "Pennsylvania",
        "major": "Mathematics",
        "merit_based_aid": true,
        "need_based_aid": true,
        "race": [
            "Black"
        ],
        "scholarship_name": "Science and Innovation Scholarship"
    },
    {
        "amount": "5000.00",
        "classification": "Freshman",
        "deadline": "04/2025",
        "description": "The Emerging Leaders Award recognizes outstanding female freshman students in Ohio who demonstrate exceptional leadership potential and a commitment to community engagement. Applicants must be pursuing a Biology major and maintain a minimum GPA of 2.6. This scholarship places a strong emphasis on applicants involved in extracurricular activities demonstrating leadership roles and volunteer experience related to environmental sustainability and community outreach. Special consideration will be given to applicants who are first-generation college students and identify as Asian, Black, or another underrepresented minority. Submit a 500-word essay detailing your leadership experiences and how you plan to contribute to your community through your Biology studies.",
        "gender": "Female",
        "gpa": 2.6,
        "hbcu": false,
        "international": false,
        "link": "https://www.ohioleaders.org/emerging-leaders-award",
        "location": "Ohio",
        "major": "Biology",
        "merit_based_aid": false,
        "need_based_aid": false,
        "race": [
            "Asian",
            "Black",
            "Other"
        ],
        "scholarship_name": "Emerging Leaders Award"
    },
    {
        "amount": "7500.00",
        "classification": "Senior",
        "deadline": "06/2025",
        "description": "The Excellence in Design Scholarship recognizes outstanding male senior students pursuing a degree in Mathematics at a Michigan-based institution. Applicants must demonstrate a strong academic record (minimum GPA of 2.9), a passion for innovative problem-solving within mathematical frameworks, and a commitment to applying their knowledge to real-world design challenges. Special consideration will be given to candidates who showcase exceptional creativity and ingenuity in their approach to mathematical concepts and their potential impact on improving design processes and outcomes.",
        "gender": "Male",
        "gpa": 2.9,
        "hbcu": false,
        "international": false,
        "link": "https://www.exampledesignscholarships.org/excellence-in-design-mathematics",
        "location": "Michigan",
        "major": "Mathematics",
        "merit_based_aid": false,
        "need_based_aid": false,
        "race": [
            "Asian"
        ],
        "scholarship_name": "Excellence in Design Scholarship"
    },
    {
        "amount": "5000.00",
        "classification": "Senior",
        "deadline": "11/2025",
        "description": "The Humanitarian Impact Award recognizes senior-level undergraduate students demonstrating exceptional commitment to community service and global citizenship. Applicants must have a minimum GPA of 2.8 and be pursuing initiatives with a measurable impact on societal well-being. Special consideration will be given to projects focused on promoting cross-cultural understanding and addressing critical humanitarian challenges through innovative solutions. International students are encouraged to apply. This is a merit-based award.",
        "gender": "Male",
        "gpa": 2.8,
        "hbcu": false,
        "international": true,
        "link": "https://www.examplehumanitarianaid.org/apply",
        "location": "Florida",
        "major": "",
        "merit_based_aid": true,
        "need_based_aid": false,
        "race": [
            "Asian"
        ],
        "scholarship_name": "Humanitarian Impact Award"
    },
    {
        "amount": "15000.00",
        "classification": "Any",
        "deadline": "11/2025",
        "description": "The Future Leaders Scholarship, sponsored by the Michigan Mathematics Consortium, aims to support outstanding male students pursuing a degree in Mathematics at a Michigan-based institution. Applicants must demonstrate academic excellence with a minimum GPA of 3.0 and a strong commitment to community service. Special consideration will be given to students involved in mathematics-related clubs, competitions, or research. This scholarship emphasizes both merit and need-based criteria, and actively encourages applications from students identifying as Black, Hispanic, or Other races, as well as those attending Historically Black Colleges and Universities. Recipients will be selected based on their academic record, essay response, and demonstrated leadership potential within their communities.",
        "gender": "Male",
        "gpa": 3.0,
        "hbcu": true,
        "international": false,
        "link": "https://www.michiganmathconsortium.org/future-leaders-scholarship",
        "location": "Michigan",
        "major": "Mathematics",
        "merit_based_aid": true,
        "need_based_aid": true,
        "race": [
            "Other",
            "Black",
            "Hispanic"
        ],
        "scholarship_name": "Future Leaders Scholarship"
    },
    {
        "amount": "12500.00",
        "classification": "Sophomore",
        "deadline": "05/2025",
        "description": "The Educational Trailblazer Scholarship is awarded to a female sophomore student in Pennsylvania pursuing a degree in Engineering. Applicants must demonstrate academic excellence with a minimum GPA of 3.6. This scholarship prioritizes students who are making a positive impact within their communities through volunteer work or innovative projects. While not mandatory, preference will be given to students of Native American, Asian, or other underrepresented racial backgrounds in STEM. This scholarship also considers leadership qualities demonstrated through extracurricular activities. HBCU attendance is a plus.",
        "gender": "Female",
        "gpa": 3.6,
        "hbcu": true,
        "international": false,
        "link": "https://www.pennsylvaniastudentaid.org/educational-trailblazer",
        "location": "Pennsylvania",
        "major": "Engineering",
        "merit_based_aid": false,
        "need_based_aid": false,
        "race": [
            "Native American",
            "Other",
            "Asian"
        ],
        "scholarship_name": "Educational Trailblazer Scholarship"
    },
    {
        "amount": "15000.00",
        "classification": "Senior",
        "deadline": "09/2025",
        "description": "The Impact Makers Scholarship supports exceptional senior students in Illinois who demonstrate a commitment to making a positive impact in their communities through biology-related initiatives. Applicants should possess a strong academic record, leadership skills, and a passion for environmental sustainability. Special consideration will be given to students involved in innovative research or community projects addressing environmental challenges in Illinois.",
        "gender": "Any",
        "gpa": 3.4,
        "hbcu": false,
        "international": false,
        "link": "https://www.impactmakersscholarships.org/apply",
        "location": "Illinois",
        "major": "Biology",
        "merit_based_aid": false,
        "need_based_aid": true,
        "race": [
            "Asian",
            "Native American",
            "Hispanic"
        ],
        "scholarship_name": "Impact Makers Scholarship"
    },
    {
        "amount": "5000.00",
        "classification": "Sophomore",
        "deadline": "03/2025",
        "description": "The Community Leadership Scholarship supports male sophomore students in Illinois pursuing Engineering degrees who demonstrate exceptional leadership potential and a commitment to community service. Applicants must have a minimum GPA of 3.5 and demonstrate financial need. International students are eligible. This scholarship prioritizes students actively involved in initiatives promoting STEM education within underserved communities and have experience mentoring or tutoring younger students in STEM fields. We encourage students from diverse backgrounds to apply.",
        "gender": "Male",
        "gpa": 3.5,
        "hbcu": false,
        "international": true,
        "link": "https://www.example.com/communityleadershipscholarship",
        "location": "Illinois",
        "major": "Engineering",
        "merit_based_aid": false,
        "need_based_aid": true,
        "race": [
            "Other"
        ],
        "scholarship_name": "Community Leadership Scholarship"
    },
    {
        "amount": "12500.00",
        "classification": "Senior",
        "deadline": "08/2025",
        "description": "The Science and Innovation Scholarship supports outstanding female senior students pursuing Engineering degrees. Applicants must demonstrate academic excellence with a minimum GPA of 3.1 and should exhibit a passion for innovation. This scholarship particularly encourages applications from Hispanic, Black, and Native American students. The scholarship focuses on fostering future leaders who will contribute to advancements in science and technology. HBCU students are encouraged to apply. This scholarship seeks to support individuals dedicated to pushing the boundaries of what's possible and creating a positive impact on the world through their work.",
        "gender": "Female",
        "gpa": 3.1,
        "hbcu": true,
        "international": false,
        "link": "https://www.example.com/science-innovation-scholarship",
        "location": "New York",
        "major": "Engineering",
        "merit_based_aid": false,
        "need_based_aid": false,
        "race": [
            "Hispanic",
            "Black",
            "Native American"
        ],
        "scholarship_name": "Science and Innovation Scholarship"
    },
    {
        "amount": "7500.00",
        "classification": "Any",
        "deadline": "04/2025",
        "description": "The Youth Leadership Award recognizes outstanding young women in Massachusetts who demonstrate exceptional leadership potential and a commitment to positive change. Applicants must be female, have a minimum GPA of 2.9, and be pursuing a degree in History. We prioritize candidates who have demonstrated leadership skills through community service, extracurricular activities, or academic achievements. Special consideration will be given to applicants who identify as Black, Hispanic, or another underrepresented race and demonstrate financial need. This scholarship seeks to empower future female leaders in historical studies.",
        "gender": "Female",
        "gpa": 2.9,
        "hbcu": false,
        "international": false,
        "link": "https://www.example.com/youthleadershipaward",
        "location": "Massachusetts",
        "major": "History",
        "merit_based_aid": true,
        "need_based_aid": true,
        "race": [
            "Other",
            "Black",
            "Hispanic"
        ],
        "scholarship_name": "Youth Leadership Award"
    },
    {
        "amount": "7500.00",
        "classification": "Senior",
        "deadline": "10/2025",
        "description": "The STEM Excellence Scholarship recognizes female-identifying students of Asian descent pursuing STEM degrees in New York. Eligibility requires a minimum 3.2 GPA and demonstrated commitment to innovation through research, projects, or relevant extracurricular activities. Special consideration will be given to applicants showcasing leadership in STEM-related community initiatives or contributions to environmental sustainability through technological advancements.",
        "gender": "Female",
        "gpa": 3.2,
        "hbcu": false,
        "international": false,
        "link": "https://www.stemexcellence.org/apply",
        "location": "New York",
        "major": "",
        "merit_based_aid": true,
        "need_based_aid": true,
        "race": [
            "Asian"
        ],
        "scholarship_name": "STEM Excellence Scholarship"
    },
    {
        "amount": "12500.00",
        "classification": "Senior",
        "deadline": "10/2025",
        "description": "The Next Gen Innovators Scholarship seeks to support outstanding female senior students in Michigan who demonstrate a passion for innovation and academic excellence. This scholarship is open to students pursuing degrees in Arts, with a minimum GPA of 3.3. Special consideration will be given to Hispanic and Asian applicants who are international students and show a commitment to community service or leadership in their field. While not need-based, this scholarship is highly merit-based, recognizing exceptional talent and potential to contribute meaningfully to the world.",
        "gender": "Female",
        "gpa": 3.3,
        "hbcu": true,
        "international": true,
        "link": "https://www.example.com/nextgeninnovators",
        "location": "Michigan",
        "major": "Arts",
        "merit_based_aid": true,
        "need_based_aid": false,
        "race": [
            "Hispanic",
            "Asian"
        ],
        "scholarship_name": "Next Gen Innovators Scholarship"
    },
    {
        "amount": "7500.00",
        "classification": "Any",
        "deadline": "03/2025",
        "description": "The Excellence in Innovation Scholarship recognizes undergraduate students pursuing Engineering degrees who demonstrate exceptional creativity and a commitment to developing innovative solutions. Applicants must have a minimum GPA of 2.7 and showcase their passion for innovation through project portfolios, research papers, or entrepreneurial ventures. Special consideration will be given to students who are actively involved in community service and who identify as Native American or Black. Both merit and need are considered. We encourage all eligible students to apply and contribute to a brighter, more innovative future.",
        "gender": "Any",
        "gpa": 2.7,
        "hbcu": true,
        "international": false,
        "link": "https://www.example.com/excellence-in-innovation-scholarship",
        "location": "Massachusetts",
        "major": "Engineering",
        "merit_based_aid": true,
        "need_based_aid": true,
        "race": [
            "Native American",
            "Black"
        ],
        "scholarship_name": "Excellence in Innovation Scholarship"
    },
    {
        "amount": "7500.00",
        "classification": "Any",
        "deadline": "05/2025",
        "description": "The Visionary Impact Award recognizes outstanding male students pursuing a degree in Biology who demonstrate a commitment to innovation and positive change within their communities. Applicants must have a minimum GPA of 2.6 and identify as Hispanic or Native American. This scholarship places special emphasis on projects or initiatives that address environmental sustainability through biological research and community engagement. Preference will be given to candidates showcasing strong leadership skills and a clear vision for leveraging their biological expertise to solve real-world problems. Successful applicants will have a proven track record of community service and a passion for environmental advocacy.",
        "gender": "Male",
        "gpa": 2.6,
        "hbcu": false,
        "international": false,
        "link": "https://www.visionaryimpactaward.org/apply",
        "location": "Michigan",
        "major": "Biology",
        "merit_based_aid": false,
        "need_based_aid": false,
        "race": [
            "Hispanic",
            "Native American"
        ],
        "scholarship_name": "Visionary Impact Award"
    },
    {
        "amount": "15000.00",
        "classification": "Any",
        "deadline": "08/2025",
        "description": "The Trailblazer Grant is designed to support outstanding male students of Asian descent pursuing degrees in Computer Science. Applicants must demonstrate a strong academic record (GPA of 3.0 or higher) and a commitment to innovation within the tech field. This scholarship prioritizes candidates showcasing leadership potential and a passion for creating impactful technology solutions. International students and those attending HBCUs are strongly encouraged to apply. The selection committee will consider both merit and financial need to ensure that deserving students have the opportunity to achieve their academic and professional goals.",
        "gender": "Male",
        "gpa": 3.0,
        "hbcu": true,
        "international": true,
        "link": "https://www.example.com/trailblazergrant",
        "location": "Georgia",
        "major": "Computer Science",
        "merit_based_aid": true,
        "need_based_aid": true,
        "race": [
            "Asian"
        ],
        "scholarship_name": "Trailblazer Grant"
    },
    {
        "amount": "12500.00",
        "classification": "Any",
        "deadline": "09/2025",
        "description": "The Digital Transformation Grant supports female Engineering students who demonstrate academic excellence and a commitment to innovation. This scholarship specifically targets individuals from underrepresented racial backgrounds (specifically Other) who are passionate about using technology to solve global challenges. International students attending universities in Illinois are encouraged to apply. Special consideration will be given to applicants showcasing leadership in projects related to data science, AI, or cybersecurity.",
        "gender": "Female",
        "gpa": 3.0,
        "hbcu": true,
        "international": true,
        "link": "https://www.example.com/digitaltransformationgrant",
        "location": "Illinois",
        "major": "Engineering",
        "merit_based_aid": true,
        "need_based_aid": false,
        "race": [
            "Other"
        ],
        "scholarship_name": "Digital Transformation Grant"
    },
    {
        "amount": "7500.00",
        "classification": "Sophomore",
        "deadline": "03/2025",
        "description": "The Next Generation Leaders Grant supports outstanding sophomore students in Florida pursuing Business degrees who demonstrate a commitment to leadership and community engagement. Applicants must have a minimum GPA of 2.9 and identify as male. Special consideration will be given to applicants from Other, Native American, or Hispanic racial or ethnic backgrounds. The grant recognizes both academic merit and financial need, with a focus on students who have demonstrated leadership potential through extracurricular activities, volunteer work, or innovative projects.",
        "gender": "Male",
        "gpa": 2.9,
        "hbcu": true,
        "international": false,
        "link": "https://www.example.com/nextgenleadersgrant",
        "location": "Florida",
        "major": "Business",
        "merit_based_aid": true,
        "need_based_aid": true,
        "race": [
            "Other",
            "Native American",
            "Hispanic"
        ],
        "scholarship_name": "Next Generation Leaders Grant"
    },
    {
        "amount": "15000.00",
        "classification": "Sophomore",
        "deadline": "12/2025",
        "description": "The Green Future Award recognizes outstanding sophomore students passionate about environmental sustainability and committed to making a positive impact on the planet. Applicants must demonstrate academic excellence with a minimum GPA of 3.5 and be pursuing a major in History, with a strong emphasis on environmental history or related fields. This scholarship prioritizes students involved in innovative environmental projects or initiatives, showcasing leadership in promoting sustainable practices within their communities or academic institutions. International students are encouraged to apply, and students from Other, Hispanic, and Asian racial backgrounds are particularly encouraged. Please include a detailed essay outlining your past environmental endeavors, future goals, and how your studies in History will contribute to a more sustainable future.",
        "gender": "Any",
        "gpa": 3.5,
        "hbcu": false,
        "international": true,
        "link": "https://www.enviroawards.org/greenfuture",
        "location": "Washington",
        "major": "History",
        "merit_based_aid": false,
        "need_based_aid": false,
        "race": [
            "Other",
            "Hispanic",
            "Asian"
        ],
        "scholarship_name": "Green Future Award"
    },
    {
        "amount": "5000.00",
        "classification": "Junior",
        "deadline": "11/2025",
        "description": "The Tech Pioneers Scholarship supports undergraduate students pursuing degrees that creatively blend arts and technology. Applicants must demonstrate academic excellence with a minimum GPA of 2.5. This scholarship prioritizes students who identify as male and are either international students or members of underrepresented racial groups (Asian, Native American, or Other). Special consideration will be given to students who showcase innovative projects that leverage technology to enhance artistic expression or solve creative challenges. Need-based aid is not considered for this merit-based scholarship.",
        "gender": "Male",
        "gpa": 2.5,
        "hbcu": true,
        "international": true,
        "link": "https://www.example.com/techpioneersscholarship",
        "location": "Texas",
        "major": "Arts",
        "merit_based_aid": true,
        "need_based_aid": false,
        "race": [
            "Other",
            "Asian",
            "Native American"
        ],
        "scholarship_name": "Tech Pioneers Scholarship"
    },
    {
        "amount": "10000.00",
        "classification": "Senior",
        "deadline": "10/2025",
        "description": "The Next Generation Leaders Grant supports outstanding senior students in Arizona who demonstrate exceptional potential to become future leaders. Applicants must have a minimum GPA of 3.1 and be pursuing a major within the Arts. This grant prioritizes students who have shown a commitment to community service and innovation within their chosen artistic field. Native American and Hispanic students are especially encouraged to apply. Both domestic and international students are eligible. The scholarship places high value on artistic excellence and demonstrable leadership qualities. While not need-based or merit-based, students must showcase their passion for Arts.",
        "gender": "Any",
        "gpa": 3.1,
        "hbcu": true,
        "international": true,
        "link": "https://www.example.com/nextgenleadersgrant",
        "location": "Arizona",
        "major": "Arts",
        "merit_based_aid": false,
        "need_based_aid": false,
        "race": [
            "Native American",
            "Hispanic"
        ],
        "scholarship_name": "Next Generation Leaders Grant"
    },
    {
        "amount": "15000.00",
        "classification": "Junior",
        "deadline": "10/2025",
        "description": "The Future Innovators Award is a scholarship designed to support female junior students in Michigan who demonstrate exceptional academic excellence and a passion for innovation. Applicants must have a minimum GPA of 3.7 and identify as Asian, Native American, or another race. This scholarship prioritizes students with demonstrated financial need and strong merit, aiming to foster future leaders in STEM and other innovative fields. Special consideration will be given to applicants who present unique project proposals showcasing their innovative ideas and potential impact on their communities. HBCU eligibility is also considered.",
        "gender": "Female",
        "gpa": 3.7,
        "hbcu": true,
        "international": false,
        "link": "https://www.futureinnovatorsaward.org/apply",
        "location": "Michigan",
        "major": "",
        "merit_based_aid": true,
        "need_based_aid": true,
        "race": [
            "Asian",
            "Other",
            "Native American"
        ],
        "scholarship_name": "Future Innovators Award"
    },
    {
        "amount": "10000.00",
        "classification": "Any",
        "deadline": "05/2025",
        "description": "The Emerging Leaders Award recognizes outstanding female students of Asian descent pursuing degrees in the Arts. Applicants must demonstrate a strong commitment to academic excellence and community service. This scholarship specifically seeks individuals who exhibit exceptional leadership potential and a passion for using their artistic talents to create positive change within their communities. Minimum GPA of 2.7 required. Submit a portfolio showcasing your artistic work and a personal essay detailing your leadership experiences and community involvement.",
        "gender": "Female",
        "gpa": 2.7,
        "hbcu": false,
        "international": false,
        "link": "https://www.example.com/emerging-leaders-award",
        "location": "Illinois",
        "major": "Arts",
        "merit_based_aid": true,
        "need_based_aid": false,
        "race": [
            "Asian"
        ],
        "scholarship_name": "Emerging Leaders Award"
    },
    {
        "amount": "5000.00",
        "classification": "Any",
        "deadline": "05/2025",
        "description": "The Future Innovators Award supports outstanding female students pursuing Arts-related majors. Applicants must have a minimum GPA of 2.9 and demonstrate a commitment to innovation and creative problem-solving. Special consideration will be given to Native American, Hispanic, and other underrepresented racial backgrounds. This scholarship focuses on fostering leadership and innovation, providing financial assistance to students who exhibit exceptional potential to make a positive impact through their artistic endeavors. Need-based and merit-based aid are both considered.",
        "gender": "Female",
        "gpa": 2.9,
        "hbcu": true,
        "international": false,
        "link": "https://www.example.com/futureinnovatorsaward",
        "location": "Arizona",
        "major": "Arts",
        "merit_based_aid": true,
        "need_based_aid": true,
        "race": [
            "Native American",
            "Other",
            "Hispanic"
        ],
        "scholarship_name": "Future Innovators Award"
    },
    {
        "amount": "15000.00",
        "classification": "Junior",
        "deadline": "09/2025",
        "description": "The Future Leaders Scholarship aims to support exceptional Computer Science students in Massachusetts who demonstrate strong leadership potential and a commitment to innovation. Applicants must have a minimum GPA of 3.2. While not exclusively for HBCU students, strong consideration will be given to applicants attending or planning to attend an HBCU. The scholarship emphasizes academic excellence, leadership, and innovation in technology, and community service. Open to students of all gender identities, and we encourage Black/African American and other racial and ethnic minority students to apply.",
        "gender": "Any",
        "gpa": 3.2,
        "hbcu": true,
        "international": false,
        "link": "https://www.example.com/futureleadersscholarship",
        "location": "Massachusetts",
        "major": "Computer Science",
        "merit_based_aid": false,
        "need_based_aid": false,
        "race": [
            "Other",
            "Black"
        ],
        "scholarship_name": "Future Leaders Scholarship"
    },
    {
        "amount": "12500.00",
        "classification": "Any",
        "deadline": "05/2025",
        "description": "The Academic Excellence Award is designed to support outstanding female students pursuing degrees in Mathematics at universities within Arizona. Applicants must demonstrate a strong academic record, maintaining a minimum GPA of 3.4. While not merit-based, this need-based scholarship prioritizes candidates from underrepresented racial backgrounds, specifically Hispanic and Black students, with a demonstrated financial need. HBCU students are highly encouraged to apply. The award recognizes not only academic achievement but also a commitment to community service and a passion for leveraging mathematical skills to address societal challenges. Special consideration will be given to applicants who can articulate innovative solutions within their field of study.",
        "gender": "Female",
        "gpa": 3.4,
        "hbcu": true,
        "international": false,
        "link": "https://www.azscholarships.org/academic-excellence-award",
        "location": "Arizona",
        "major": "Mathematics",
        "merit_based_aid": false,
        "need_based_aid": true,
        "race": [
            "Hispanic",
            "Black"
        ],
        "scholarship_name": "Academic Excellence Award"
    },
    {
        "amount": "7500.00",
        "classification": "Freshman",
        "deadline": "12/2025",
        "description": "The Creative Minds Grant supports incoming freshman male students pursuing degrees in Mathematics. Applicants must demonstrate academic excellence with a minimum GPA of 3.3 and financial need. This scholarship particularly values creativity and innovation in problem-solving. Black and Native American students are strongly encouraged to apply. Priority will be given to applicants involved in community service or innovative extracurricular activities. Students identifying as 'Other' race can provide details in their application.",
        "gender": "Male",
        "gpa": 3.3,
        "hbcu": true,
        "international": false,
        "link": "https://www.example.edu/creativemindsgrant",
        "location": "Florida",
        "major": "Mathematics",
        "merit_based_aid": false,
        "need_based_aid": true,
        "race": [
            "Black",
            "Native American",
            "Other"
        ],
        "scholarship_name": "Creative Minds Grant"
    },
    {
        "amount": "7500.00",
        "classification": "Junior",
        "deadline": "09/2025",
        "description": "The Next Gen Innovators Scholarship seeks to empower young women from diverse racial backgrounds who are pursuing degrees in History and demonstrate financial need. Applicants must maintain a 3.4 GPA and be actively involved in extracurricular activities or community service. Special consideration will be given to students whose historical research focuses on marginalized communities and promotes social justice. International students are welcome to apply.",
        "gender": "Female",
        "gpa": 3.4,
        "hbcu": false,
        "international": true,
        "link": "https://www.example.com/nextgeninnovators",
        "location": "Illinois",
        "major": "History",
        "merit_based_aid": false,
        "need_based_aid": true,
        "race": [
            "Asian",
            "Native American",
            "Black"
        ],
        "scholarship_name": "Next Gen Innovators Scholarship"
    },
    {
        "amount": "5000.00",
        "classification": "Any",
        "deadline": "09/2025",
        "description": "The Cultural Enrichment Award is designed to support outstanding female students pursuing degrees in Mathematics who demonstrate a commitment to cultural understanding and exchange. Applicants must maintain a GPA of 3.6 or higher and identify as either Hispanic or Native American. This scholarship prioritizes students with international experience or a demonstrated interest in global issues. While not need-based or solely merit-based, preference will be given to candidates who exhibit leadership qualities and innovative approaches to problem-solving within their communities. HBCU students and international students are encouraged to apply.",
        "gender": "Female",
        "gpa": 3.6,
        "hbcu": true,
        "international": true,
        "link": "https://www.example.com/cultural-enrichment-award",
        "location": "Washington",
        "major": "Mathematics",
        "merit_based_aid": false,
        "need_based_aid": false,
        "race": [
            "Hispanic",
            "Native American"
        ],
        "scholarship_name": "Cultural Enrichment Award"
    },
    {
        "amount": "10000.00",
        "classification": "Senior",
        "deadline": "10/2025",
        "description": "The Next Gen Innovators Scholarship supports outstanding male students pursuing Biology degrees in Texas. Applicants must demonstrate academic excellence with a minimum GPA of 2.8 and a commitment to innovation. Preference will be given to Hispanic and Native American students who are actively involved in community service and demonstrate leadership potential. This scholarship seeks to support students with financial need and is open to both domestic and international students attending Historically Black Colleges and Universities (HBCUs) within Texas. Special consideration will be given to those developing sustainable solutions in their respective fields. Recipients will be asked to participate in innovation workshops. ",
        "gender": "Male",
        "gpa": 2.8,
        "hbcu": true,
        "international": true,
        "link": "https://www.example.com/next-gen-innovators-scholarship",
        "location": "Texas",
        "major": "Biology",
        "merit_based_aid": true,
        "need_based_aid": true,
        "race": [
            "Hispanic",
            "Native American"
        ],
        "scholarship_name": "Next Gen Innovators Scholarship"
    },
    {
        "amount": "15000.00",
        "classification": "Junior",
        "deadline": "10/2025",
        "description": "The Artistic Vision Award recognizes outstanding junior-level students pursuing degrees in Business who demonstrate exceptional creativity and innovative thinking in their academic and extracurricular pursuits. Applicants must have a minimum GPA of 2.9 and demonstrate financial need. This scholarship is open to students of all gender identities, with particular encouragement for those who identify as Hispanic or any other race/ethnicity not traditionally represented in the field of business. The selection committee looks for candidates who can articulate a clear vision for leveraging their business acumen to foster creative solutions in their communities. Focus areas include innovation, leadership, and community service.",
        "gender": "Any",
        "gpa": 2.9,
        "hbcu": false,
        "international": false,
        "link": "https://www.artisticvisionaward.org",
        "location": "Illinois",
        "major": "Business",
        "merit_based_aid": false,
        "need_based_aid": true,
        "race": [
            "Other",
            "Hispanic"
        ],
        "scholarship_name": "Artistic Vision Award"
    },
    {
        "amount": "7500.00",
        "classification": "Freshman",
        "deadline": "11/2025",
        "description": "The Tech Pioneers Scholarship aims to support the next generation of innovators in Computer Science. Eligibility requires a minimum GPA of 2.7 and demonstrated interest in technology through projects, coursework, or extracurricular activities. Special consideration will be given to students who have contributed to open-source projects or have innovative ideas with societal impact, particularly those focusing on accessibility or environmental sustainability. Open to both domestic and international students.",
        "gender": "Any",
        "gpa": 2.7,
        "hbcu": true,
        "international": true,
        "link": "https://www.example.com/techpioneersscholarship",
        "location": "Georgia",
        "major": "Computer Science",
        "merit_based_aid": false,
        "need_based_aid": false,
        "race": [
            "Native American",
            "Asian",
            "Hispanic"
        ],
        "scholarship_name": "Tech Pioneers Scholarship"
    },
    {
        "amount": "7500.00",
        "classification": "Freshman",
        "deadline": "07/2025",
        "description": "The Inspirational Achievement Grant recognizes outstanding high school seniors entering their freshman year of college who have demonstrated a commitment to academic excellence and community involvement. This scholarship prioritizes students who have overcome significant personal challenges and displayed exceptional leadership skills in extracurricular activities. Applicants must have a minimum GPA of 2.9 and be pursuing a degree in History. We strongly encourage students from diverse backgrounds, including Asian, Hispanic, and other underrepresented communities, to apply. The selection committee will especially value essays that highlight the applicant's resilience, passion for history, and dedication to making a positive impact on society.",
        "gender": "Any",
        "gpa": 2.9,
        "hbcu": true,
        "international": false,
        "link": "https://www.example.com/inspirationalachievementgrant",
        "location": "Massachusetts",
        "major": "History",
        "merit_based_aid": true,
        "need_based_aid": true,
        "race": [
            "Asian",
            "Hispanic",
            "Other"
        ],
        "scholarship_name": "Inspirational Achievement Grant"
    },
    {
        "amount": "7500.00",
        "classification": "Senior",
        "deadline": "07/2025",
        "description": "The Emerging Leaders Award recognizes outstanding female students of Hispanic or other descent in Texas who demonstrate exceptional leadership potential and a commitment to community engagement. Applicants must have a minimum GPA of 2.6 and be pursuing any field of study. This scholarship emphasizes recognizing individuals who actively participate in extracurricular activities, volunteer work, or community initiatives. Special consideration will be given to candidates who demonstrate innovative approaches to problem-solving and a dedication to improving the lives of others. Leadership roles in student organizations, significant volunteer contributions, or innovative project leadership are highly valued.",
        "gender": "Female",
        "gpa": 2.6,
        "hbcu": false,
        "international": false,
        "link": "https://www.example.com/emergingleadersaward",
        "location": "Texas",
        "major": "",
        "merit_based_aid": true,
        "need_based_aid": false,
        "race": [
            "Hispanic",
            "Other"
        ],
        "scholarship_name": "Emerging Leaders Award"
    },
    {
        "amount": "7500.00",
        "classification": "Freshman",
        "deadline": "06/2025",
        "description": "The Technology Leadership Award recognizes outstanding female freshman students pursuing a degree in Business with a demonstrated passion for technology and leadership. Applicants must have a minimum GPA of 2.5 and demonstrate active involvement in community service initiatives. Special consideration will be given to students of Native American or other underrepresented backgrounds who exhibit innovative thinking and a commitment to using technology for positive social impact. This merit-based scholarship aims to empower future female leaders in the intersection of business and technology.",
        "gender": "Female",
        "gpa": 2.5,
        "hbcu": true,
        "international": false,
        "link": "https://www.example.com/technologyleadershipaward",
        "location": "New York",
        "major": "Business",
        "merit_based_aid": true,
        "need_based_aid": false,
        "race": [
            "Native American",
            "Other"
        ],
        "scholarship_name": "Technology Leadership Award"
    },
    {
        "amount": "15000.00",
        "classification": "Sophomore",
        "deadline": "10/2025",
        "description": "The Breakthrough Innovators Scholarship recognizes female sophomore students in Pennsylvania pursuing mathematics degrees who demonstrate exceptional academic achievement and a passion for innovative problem-solving. Applicants should have a minimum GPA of 2.5 and demonstrate involvement in extracurricular activities or projects that showcase their mathematical creativity and ingenuity. Special consideration will be given to applicants who have developed original mathematical models, algorithms, or solutions with potential applications in real-world scenarios. This merit-based scholarship aims to support the next generation of female mathematicians who are pushing the boundaries of their field.",
        "gender": "Female",
        "gpa": 2.5,
        "hbcu": false,
        "international": false,
        "link": "https://www.example.com/breakthrough-innovators-scholarship",
        "location": "Pennsylvania",
        "major": "Mathematics",
        "merit_based_aid": true,
        "need_based_aid": false,
        "race": [
            "Asian",
            "Other",
            "Hispanic"
        ],
        "scholarship_name": "Breakthrough Innovators Scholarship"
    },
    {
        "amount": "15000.00",
        "classification": "Any",
        "deadline": "07/2025",
        "description": "The Emerging Leaders Award recognizes outstanding male students of Native American descent pursuing degrees in Business. Applicants must demonstrate academic excellence with a minimum GPA of 2.7, a commitment to community service, and exceptional leadership potential. Special consideration will be given to candidates who showcase innovative ideas and entrepreneurial spirit, as the scholarship aims to foster the next generation of Native American business leaders. This scholarship encourages applications from students attending Historically Black Colleges and Universities (HBCUs).",
        "gender": "Male",
        "gpa": 2.7,
        "hbcu": true,
        "international": false,
        "link": "https://www.example.com/emerging-leaders-award",
        "location": "California",
        "major": "Business",
        "merit_based_aid": true,
        "need_based_aid": false,
        "race": [
            "Native American"
        ],
        "scholarship_name": "Emerging Leaders Award"
    },
    {
        "amount": "12500.00",
        "classification": "Junior",
        "deadline": "05/2025",
        "description": "The Next Gen Innovators Scholarship aims to support exceptional junior-level students pursuing Biology degrees in California. Eligibility requires a minimum GPA of 2.8 and demonstrated involvement in innovative projects related to environmental sustainability or biotechnology. International students are encouraged to apply. This scholarship emphasizes leadership and community engagement, with a focus on applicants who can articulate their vision for future contributions to the field of biology. While academic excellence is considered, the scholarship prioritizes applicants with demonstrated leadership skills and innovative ideas.",
        "gender": "Any",
        "gpa": 2.8,
        "hbcu": false,
        "international": true,
        "link": "https://www.example.com/nextgeninnovators",
        "location": "California",
        "major": "Biology",
        "merit_based_aid": false,
        "need_based_aid": false,
        "race": [
            "Native American",
            "Black",
            "Asian"
        ],
        "scholarship_name": "Next Gen Innovators Scholarship"
    },
    {
        "amount": "5000.00",
        "classification": "Senior",
        "deadline": "04/2025",
        "description": "The Social Impact Scholarship is awarded to male-identifying senior students pursuing a degree in Mathematics at a university located in New York. Applicants must maintain a minimum GPA of 2.7 and demonstrate a commitment to utilizing their mathematical skills for social good. Special consideration will be given to students who have contributed to community-based projects involving data analysis or modeling to address societal challenges. Students attending Historically Black Colleges and Universities (HBCUs) are strongly encouraged to apply. This merit-based scholarship recognizes academic excellence and the potential for future leadership in applying mathematics to create positive change.",
        "gender": "Male",
        "gpa": 2.7,
        "hbcu": true,
        "international": false,
        "link": "https://www.example.com/socialimpactscholarship",
        "location": "New York",
        "major": "Mathematics",
        "merit_based_aid": true,
        "need_based_aid": false,
        "race": [
            "Black"
        ],
        "scholarship_name": "Social Impact Scholarship"
    },
    {
        "amount": "10000.00",
        "classification": "Senior",
        "deadline": "03/2025",
        "description": "The Visionary Impact Award recognizes outstanding male senior students in Arizona who demonstrate exceptional academic achievement and a commitment to innovative engineering solutions that address real-world challenges. Applicants should possess a minimum GPA of 3.7 and be pursuing a major in any Engineering discipline. This scholarship places special emphasis on students from underrepresented racial backgrounds (Black, Asian, Hispanic) who have a demonstrated need for financial assistance and are either U.S. citizens attending HBCUs or are international students. Merit-based criteria include innovative project development and leadership in engineering-related extracurricular activities.",
        "gender": "Male",
        "gpa": 3.7,
        "hbcu": true,
        "international": true,
        "link": "https://www.exampleengineeringawards.org/visionary-impact-award",
        "location": "Arizona",
        "major": "Engineering",
        "merit_based_aid": true,
        "need_based_aid": true,
        "race": [
            "Black",
            "Asian",
            "Hispanic"
        ],
        "scholarship_name": "Visionary Impact Award"
    },
    {
        "amount": "12500.00",
        "classification": "Senior",
        "deadline": "07/2025",
        "description": "The Diversity and Inclusion Scholarship supports Black male students pursuing degrees in the Arts at universities within North Carolina. Applicants must demonstrate financial need and maintain a minimum GPA of 2.8. Preference will be given to students who actively participate in community service initiatives, particularly those focused on promoting diversity and inclusion within their local communities or on campus. This scholarship aims to foster a more inclusive arts environment by supporting talented individuals from underrepresented backgrounds, removing financial obstacles so they may thrive during their academic careers.",
        "gender": "Male",
        "gpa": 2.8,
        "hbcu": false,
        "international": false,
        "link": "https://www.diversity-inclusion-scholarships.org/apply",
        "location": "North Carolina",
        "major": "Arts",
        "merit_based_aid": false,
        "need_based_aid": true,
        "race": [
            "Black"
        ],
        "scholarship_name": "Diversity and Inclusion Scholarship"
    }
]